{
  "courseId": "m3epsa7czlnnzmo4ox",
  "courseTitle": "מסע לעבר האתר",
  "courseDescription": "קורס הבסיס לפיתוח אתרי אינטרנט בעזרת שפת HTML, עיצוב אתרים בעזרת CSS, ופיתוח פונקציונלי בעזרת שפת Java Script הפופולרית. את הקורס מלווים תרגולים רבים לחומר התאורתי בהשראת ההיסטוריה של מדינת ישראל.",
  "courseContent": [
    {
      "module": 1,
      "title": "הקדמה",
      "lessons": [
        {
          "lessonId": "1.1",
          "title": "אודות הקורס",
          "sections": [
            {
              "sectionTitle": "מה נלמד בקורס?",
              "textBlock": [
                "ברוכים הבאים לעולם התכנות ופיתוח אתרי אינטרנט. בקורס שלפנינו נכיר מושגים בסיסיים מעולם התכנות והפיתוח. נלמד איך אתר אינטרנט בנוי, נכיר מקרוב סוגים שונים של אתרי אינטרנט וננסה לזהות דפוסים חוזרים שבהם משתמשים באתרי אינטרנט מוכרים ופחות מוכרים.",
                "אבל החלק העיקרי והטוב של הקורס הזה הוא היצירה העצמאית. אנחנו נלמד את שפת הפיתוח הפופולרית שבעזרתה כל אתרי האינטרנט בעולם כתובים - שפת HTML. נכיר את כל המרכיבים הבסיסיים שעוזרים לנו לבנות דף אינטרנט עם רכיבים שונים כמו כותרות, טקסטים, תמונות, קישורים ועוד רכיבים רבים ומגוונים.",
                "נכיר גם את שפת העיצוב והסגנון של אתרי אינטרנט - CSS - שבעזרתה נוכל לטפל בפן החזותי של האתר, ולדאוג שהאתר שלנו יהיה קריא, נעים לעין ונגיש לכל משתמש שמבקר באתר שלנו. נראה שעיצוב זה לא רק לעשות אתר יפה, אלא זה הרבה מעבר לזה, נבין כיצד עיצוב אתר אינטרנט יכול להשפיע בצורה דרמטית על חוויית המשתמש של הגולש באתר האינטרנט, ואפילו נראה שעיצוב נכון יכול גם להקל את ההתמצאות באתר גם עבור אנשים עם מוגבלויות.",
                "אחרי כל זה גם נצלול למעמקי שפת התכנות הפופולרית Java Script, שבאמצעותה נוכל לחבר לכל מה שנבנה ב-HTML וב-CSS, את האינטראקטיביות לאתר האינטרנט. או במילים אחרות, להוסיף נשמה וחַיוּת לאתר שלנו. בפרק הזה נבין גם מה זה פונקציונליות ומודולריות.",
                "לאורך הקורס נלמד לא רק איך לבנות אתר שיהיה נוח ונעים לקריאה למשתמש הקצה. אלא גם נלמד כיצד לעבוד בצורה נקייה ומסודרת כמתכנתים צעירים. נכיר שיטות עבודה וכלים שיעזרו לנו בתהליך הפיתוח, ונסגל לעצמנו הרגלי עבודה נכונים."
              ]
            }
          ]
        },
        {
          "lessonId": "1.2",
          "title": "מה זה אינטרנט?",
          "sections": [
            {
              "sectionTitle": "אינטרנט?"
            }
          ]
        },
        {
          "lessonId": "1.3",
          "title": "עורכי קוד (Text Editors)",
          "sections": [
            {
              "sectionTitle": "סביבות עבודה ועורכי קוד",
              "textBlock": [
                "לפני שאנחנו ניגשים למלאכת כתיבת הקוד ובניית אתר אינטרנט, בואו ונכיר את סביבות העבודה שאנחנו יכולים לעבוד בהן. חשוב להבין קודם כל שקוד הוא פשוט מאוד - טקסט. זה בסך הכל קובץ טקסטואלי שבתהליכים מסוימים המחשב יודע לתרגם את הטקסט הזה לשפת מכונה ולתת לנו את התוצאה הרצויה (בקורס הזה אנחנו לא נלמד לתכנת בשפת המכונה). לכן, אנחנו יכולים לכתוב קוד HTML אפילו בקובץ Notepad עם סיומת txt הכי פשוט שיש.",
                "יחד עם זאת, קיימות מספר תוכנות לכתיבה ועריכת קוד שהופכות את החיים שלנו כמתכנתים להרבה יותר קלים. התוכנות האלה כבר מכירות את שפת הפיתוח ויודעות להשלים מילות מפתח, הן יודעות לסמן מילות מפתח מסוגים שונים בצבעים שונים וכך להפוך את הקוד לקריא וברור יותר. והן מתממשקות בצורה קלה ופשוט עם הדפדפן ומאפשרות לנו לראות את התוצאה של מה שכתבנו באופן מיידי."
              ]
            },
            {
              "sectionTitle": "Visual Studio Code",
              "textBlock": [
                "אחת התוכנות הנפוצות ביותר והשימושיות היא Visual Studio Code, או בשמה המקוצר - VS-Code, היא תוכנת עריכת קוד שפותחה על-ידי חברת Microsoft והיא חופשית לשימוש ללא דמי תשלום.",
                "את תוכנת עריכת הקוד VS-Code ניתן להוריד מהאתר הרשמי שלה. ישנן מספר גרסאות של התוכנה שמותאמות למערכות הפעלה. הקורס הזה מותאם למערכת הפעלה Windows, אבל בהחלט אפשר ללמוד בקורס גם עם מערכות הפעלה שונות ולעשות את ההתאמות הדרושות."
              ],
              "bigButton": {
                "urlLink": "https://code.visualstudio.com/",
                "text": "Visual Studio Code - Code Editor"
              }
            },
            {
              "textBlock": [
                "לאחר ההורדה וההתקנה של עורך הקוד במחשב אנחנו נדרשים לעוד שני כלי עבודה חשובים שיהפכו לנו את החיים כמתכנתים לקלים יותר. הראשון הוא כמובן דפדפן (Browser) שככל הנראה יש לכולנו אחד כזה במחשב, בדיוק אותו דפדפן שאתם גולשים באמצעותו באינטרנט. ההמלצה היא להשתמש לפחות בשני דפדפנים שונים, בין הדפדפנים הפופולריים, כדי לראות שהאתר שאנחנו בונים נראה כפי שאנחנו רוצים שיראה. הדפדפנים הפופולריים והנפוצים שמומלץ להשתמש בהם הם Google Chrome, Microsoft Edge ו-Firefox.",
                "כמו כן, כלי נוסף וחשוב שכדאי להתקין בתוך תוכנת VS-Code הוא כלי ה-Live Server. כלי זה הוא למעשה תוכנת הרחבה שנמצאת בתוך ה-VS-Code, וכדי להתקין אותה אנחנו צריכים לגשת לספריית ההרחבות (Extentions) שנמצאת בסרגל שבצד שמאל של חלון התוכנה, לכתוב בשורת החיפוש Live Server ולבצע התקנה."
              ],
              "bigButton": {
                "urlLink": "https://marketplace.visualstudio.com/items?itemName=ritwickdey.LiveServer",
                "text": "Live Server Extention"
              }
            },
            {
              "textBlock": [
                "לאחר שהורדנו והתקנו את עורך הקוד (Code Editor), דאגנו שיש לנו דפדפן (Browser), ווידאנו שההרחבה Live Server מותקנת בעורך הקוד, אנחנו יכולים בחלון הקוד על הלחצן הימני של העכבר ולבחור באפשרות Open with Live Server. מיד נוכל לראות שחלון של דפדפן ברירת המחדל שהגדרנו יפתח ויציג לנו את התוצאה של הקוד שכתבנו בקובץ ה-HTML."
              ]
            }
          ]
        },
        {
          "lessonId": "1.4",
          "title": "סביבות עבודה: Git & GitHub",
          "sections": [
            {
              "sectionTitle": "Git"
            },
            {
              "sectionTitle": "GitHub"
            }
          ]
        }
      ]
    },
    {
      "module": 2,
      "title": "HTML",
      "lessons": [
        {
          "lessonId": "2.1",
          "title": "המבנה האנטומי של עמוד HTML - חלק ראשון",
          "sections": [
            {
              "sectionTitle": "מה זה HTML?",
              "image": {
                "url": "/images/stylingImages/cover-html.png",
                "altText": "Architecture- classical. Corinthian column detail.",
                "descText": "Architecture- classical. Corinthian column detail. Photo by Paulina Milde-Jachowska on Unsplash.",
                "width": [
                  300,
                  500
                ]
              }
            },
            {
              "textBlock": [
                "HTML ,ראשי תיבות של HyperText Markup Language, זו למעשה שפת תגיות שעל בסיסה כל אתרי האינטרנט בנויים. מסמך HTML קובע את המבנה של עמוד אינטרנט ואת המשמעויות של התכנים והרכיבים שנמצאים בעמוד האינטרנט. משמעות המונח HyperText בראשי התיבות מתייחסת לקשרים שבין דפי אינטרנט שונים, ובכלל זאת גם בין אתרי אינטרנט. כלומר ברגע שאנחנו מעלים תוכן ויוצרים דף אינטרנט, אנחנו הופכים באותו רגע למשתתפים פעילים ב-World Wide Web - רשת האינטרנט הגדולה.",
                "המונח Markup שבראשי התיבות מתייחס לתגיות שמגדירות כל סוג של תוכן שמופיע בעמוד האינטרנט למשל תכנים מילוליים מוגדרים על-ידי תגיות מסוימות, תכנים חזותיים מוגדרים על-ידי תגיות אחרות. ויש גם תגיות שמגדירות אזורים מסויימים בתוך העמוד בעלי מאפיינים שונים ויחודיים. כמו כן, יש תגיות שבהגדרה שלהן מתייחסות לתוכן שמוצג בדפדפן, ותגיות אחרות שמציינות פרטים טכניים על האתר ונשארות מאחורי הקלעים. בפרק הזה של הקורס אנחנו נלמד על כל התגיות הבסיסיות ועל התפקידים היחודיים של כל אחת.",
                "כל רכיב שאנחנו רוצים לשים בעמוד אינטרנט שאנחנו יוצרים צריך להיות תחום בין תגית פתיחה לתגית סגירה. לדוגמא, אם אנחנו רוצים להוסיף את המשפט \"כי האדם עץ השדה\" אנחנו נעטוף את המשפט הזה בתג פסקה פותח ובתג פסקה סוגר."
              ],
              "codeBox": {
                "lines": [
                  {
                    "element": "<p>כי האדם עץ השדה</p>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "codeLang": "HTML"
              }
            },
            {
              "sectionTitle": "המבנה האנטומי של מסמך HTML",
              "textBlock": [
                "לכל עמוד אינטרנט יש מבנה בסיסי אחיד וקבוע. ראשית כל, המסמך תחום כולו בתגי <html> אשר בין התג הפותח לתג הסוגר אנחנו נכתוב את כל הקוד של העמוד. בין התגים האלה יופיעו תמיד עוד שני סוגים של תגים - תג <head> ותג <body>."
              ],
              "codeBox": {
                "lines": [
                  {
                    "element": "<!DOCTYPE html>",
                    "spaces": 0,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<html>",
                    "spaces": 0,
                    "color": "red.300"
                  },
                  {
                    "element": "<head>",
                    "spaces": 2,
                    "color": "blue.300"
                  },
                  {
                    "element": "<meta charset=\"UTF-8\" />",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<title>Document</title>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<style></style>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "</head>",
                    "spaces": 2,
                    "color": "blue.300"
                  },
                  {
                    "element": "<body>",
                    "spaces": 2,
                    "color": "green.300"
                  },
                  {
                    "element": "",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "</body>",
                    "spaces": 2,
                    "color": "green.300"
                  },
                  {
                    "element": "</html>",
                    "spaces": 0,
                    "color": "red.300"
                  }
                ],
                "codeLang": "HTML"
              }
            },
            {
              "sectionTitle": "תגיות <html></html>",
              "textBlock": [
                "כדי להגדיר מסמך כמסמך אינטרנט, התגיות הראשונות שאנחנו חייבים לציין הן תגיות <html> כתגית פותחת בתחילת המסמך, ותגית <html/> כתגית סוגרת בסוף המסמך. התגיות האלה מגדירות את המסמך הממשי, ובינהן יבוא כל התוכן של העמוד.",
                "כמו כן, בנוסף לצמד התגיות האלה, בכל מסמך HTML חייב גם להיות ציון בראש המסמך על-ידי התגית <DOCTYPE html!> אשר מציינת את גרסת ה-HTML שבה נעשה שימוש במסמך. בגרסת HTML5 משתמשים בתגית זו. בהמשך הקורס נלמד יותר לעומק על השינוי שגרסת HTML5 הביאה לעולם פיתוח האתרים, ועל היתרונות הרבים שלה."
              ]
            },
            {
              "sectionTitle": "תגיות <head></head>",
              "textBlock": [
                "בין צמד התגיות האלה יופיעו כל הפרטים על דף האינטרנט אשר לא אינם מוצגים על המסך. כלומר כל אותם פרטים שהדפדפנים משתמשים בהם כדי להבין את סוג העמוד והתוכן שבו. לדוגמא, פרטים כמו שיטת קידוד המלל, תצוגת מסך אופטימלית של האתר, עיצוב וסגנון ועוד דברים שנלמד בהמשך הקורס..",
                "בין תגים אלה אנחנו גם תמיד נמצא את צמד תגי <title></title> שמציינים את כותרת העמוד, אשר תופיע בכותרת חלון הדפדפן של אותו עמוד."
              ]
            },
            {
              "sectionTitle": "תגיות <body></body>",
              "textBlock": [
                "בין צמד התגיות האלה נמצא את הרכיבים החזותיים שמוצגים בעמוד בדפדפן האינטרנט. כלומר על קטעי המלל, תמונות, גרפים, טפסים, קישורים וכפתורים ועוד רכיבים רבים שאנחנו בוחרים להציב בתוך העמוד שאנחנו בונים."
              ]
            },
            {
              "sectionTitle": "תגיות <div></div>",
              "textBlock": [
                "כל הרכיבים שאנחנו נבחר לשים בתוך עמוד האינטרנט יהיו אף הם בבלוקים משלהם. בשביל ליצור את הבלוקים האלה אנחנו נשתמש בתגית הבלוק הכללית (The Content Division element) בעזרת התגיות <div> ו-<div/>. בעזרתן אנחנו נוכל לחלק את העמוד לאזורים מוגדרים ונפרדים, לעצב כל איזור בעיצוב ייחודי, למקם את הבלוקים במיקומים מוגדרים, ולמעשה לשחק איתם כרצוננו ולקבוע הכל. "
              ]
            },
            {
              "sectionTitle": "הערות מְפַתֵּחַ (Comments)",
              "textBlock": [
                "עבודת המתכנת היא עבודה שדורשת זמן רב, יש פעמים שאנחנו נעבוד לבד על פרויקט במשך תקופה מסוימת, ויש פעמים שנעבוד בקבוצה עם עוד אנשים על אותו פרויקט. לכן כדאי שנסגל לעצמנו הרגלים נכונים בכתיבת הקוד שיעזרו לנו ולמתכנתים אחרים להבין מה כתבנו, כדי שיהיה אפשר להשתלב בקוד שלנו בצורה מהירה. בין אם זה מתכנתים אחרים שרואים את הקוד שלנו בפעם הראשונה, ובין אם זה אנחנו בעצמנו שרוצים לחזור לקוד שלנו אחרי מספר ימים, שבועות ואפילו חודשים, כדי לתקן או לשפר קטע מסוים בו. לתכונה הזאת קוראים קריאות של הקוד (Readablity) ככל שהקוד שלנו יהיה יותר נקי, מסודר ומפורט, למעשה הוא יהיה קריא יותר, ויהיה לנו ולאחרים יותר קל לעבוד איתו ולהשתלב בו.",
                "אחד הדברים החשובים שאנחנו צריכים להכיר הן הערות מְפַתֵּחַ (Comments). אלה קטעים בקוד שאנחנו יכולים לכתוב כל מה שאנחנו רוצים בשפה פשוטה כדי לתאר מה עשינו, או להסביר כמה מילים על מה שכתבנו. אנחנו יכולים לכתוב אפילו בעברית את ההערות האלו, והן לא ישפיעו במאום על הניראות או על התוכן של עמוד האינטרנט בדפדפן.",
                "את ההערכות בשפת HTML אנחנו יכולים להוסיף באופן הבא:"
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<!-- This is a comment, doesn't show in the output -->",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<p>This is a paragraph.</p>",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "</body>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "p",
                    "content": "This is a paragraph.",
                    "style": {}
                  }
                ]
              }
            },
            {
              "textBlock": [
                "מלבד זאת להערות יכול להיות שימוש נוסף בתהליך כתיבת הקוד. אם התחלנו לכתוב קטע קוד מסוים שהעבודה עליו טרם הושלמה, מחד איננו רוצים שהוא יוצג בדפדפן, ומאידך אנחנו לא רוצים למחוק אותו. הפתרון הוא להכניס את אותו קטע קוד להערה ולהמשיך לעבוד עליו בפעמים הבאות שנחזור לקוד."
              ]
            },
            {
              "resources": [
                {
                  "title": "HTML doctype declaration / Article by W3Schools",
                  "url": "https://www.w3schools.com/tags/tag_doctype.ASP"
                },
                {
                  "title": "HTML Comments / Article by W3Schools",
                  "url": "https://www.w3schools.com/html/html_comments.asp"
                }
              ]
            }
          ]
        },
        {
          "lessonId": "2.2",
          "title": "רכיבים מילוליים: כותרות, פסקאות ורשימות (Headings, Paragraphs & Lists)",
          "sections": [
            {
              "sectionTitle": "סוגי טקסטים",
              "textBlock": [
                "מילים מהוות חלק עיקרי ומשמעותי מאוד בכל אתר אינטרנט. אבל אם כל התוכן המילולי יהיה אחיד וזהה חווית המשתמש עלולה להיפגע מאוד, ואף ההתמצאות באתר עלולה להפוך למשימה מסורבלת ומעיקה. ",
                "עוד הרבה לפני שהאינטרנט נכנס לחיינו, ואיתו המדיה הדיגיטלית, התקשורת התבססה בעיקר על עיתונים מודפסים. בעיתון \"דבר\", מספטמבר 1929, שמובא כאן כדוגמא אנחנו יכולים לראות את ההבדלים הטקסטואליים. אנחנו יכולים לראות שישנן כותרות, פסקאות, הערות שוליים וקרדיטים. סוגי הטקסטים השונים נבדלים זה מזה במאפיינים שונים, בעיקר בגודל האותיות, והם למעשה מה שעוזר לקורא להתמצא בצורה טובה יותר בעיתון, להבין איפה מתחילה כתבה, והיכן היא מסתיימת, לזהות את נושא הכתבה ולהחליט אם היא מספיק מעניינת אותו כדי להמשיך לקרוא."
              ],
              "image": {
                "url": "/images/lessonsContents/module2/lesson2/article_davar_6-9-1929.png",
                "altText": "עיתון דבר, 1929",
                "imageSubject": "",
                "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"דבר\", 6 בספטמבר 1929.",
                "width": [
                  300,
                  400
                ]
              }
            },
            {
              "textBlock": [
                "באותו אופן גם המדיה הדיגיטלית עובדת. גם כשאנחנו מתכננים עמוד אינטרנט, אנחנו נדאג שיהיו בו כותרות, חלוקה לפסקאות, הערות שוליים אם צריך, קרדיטים וכיוצא באלה. אם אנחנו עובדים עם טקסט ארוך כמו פרסום בבלוג, פוסט או כתבה, אז גם נדאג לעשות ריווח בין השורות ובין הפסקאות. הכל על מנת לאפשר נוחות מירבית למשתמשים באתר שלנו.",
                "כמו שכבר למדנו בשיעור הקודם במבנה הבסיסי של מסמך HTML, טקסטים הם רכיב שאנחנו רוצים להציג למשתמש. לכן כל התגיות האלה יתווספו בין תגי ה-<body>. "
              ]
            },
            {
              "sectionTitle": "כותרות (Headings)",
              "textBlock": [
                "עומדות לרשותנו שישה סוגי כותרות שאנחנו יכולים להשתמש בהן בתוך המסמך. התג שמגדיר כותרת מכיל את האות \"h\" וספרה בין 1 ל-6. כאשר <h1> היא כותרת ראשית, והכותרות הבאות הן תתי-כותרות ברמה חשיבות שהולכת וקטנה.",
                "בנוסף לזאת, כותרות הן מה שנקרא רכיב block-level, כלומר רכיב שכברירת מחדל מופיע בעמוד בשורה חדשה ותופס את כל רוחב השורה. אך דבר אינו גזירת גורל, שכן אנחנו יכולים לשנות תכונות שונות של הכותרת באמצעות מאפיינים עיצוביים, שנלמד להם מעט ביחידה זו של הקורס, ובהרחבה ביחידה הבאה.",
                "הרמות השונות של הכותרות לא רק נבדלות בגודל של הטקסט, אלא יש להן גם משמעות סמנטית. כאשר הדפדפן קורא את מסמך ה-HTML כדי להציגו על המסך הוא יודע לזהות את סוגי הכותרות האלה. גם מנועי החיפוש משתמשים בסמנטיקה של הכותרות כדי להבין את תוכן האתר ולהציג תוצאות רלוונטיות. חשוב באותה מידה, גם קוראי מסך (Screen Reader), שאנשים עם עיוורון או עם לקות ראייה משתמשים בהם, מתייחסים לסמנטיקה של הכותרות כדי לנווט בעמוד בצורה יעילה וברורה.",
                "כדי לנצל את היכולות של מנועי החיפוש, וגם כדי לא לבלבל את קוראי המסך (Screen Readers) נהוג להשתמש פעם אחת בלבד בכל עמוד בכותרת הראשית <h1>. בדרך כלל נשתמש בה עבור כותרת האתר כולו. חשוב גם לשמור על שימוש בכותרות לפי סדר המספרים, בלי לדלג על דרגות. כלומר אם לא השתמשנו בעמוד בכותרת <h3>, אז לא נשתמש בכותרת <h4>."
              ],
              "codeBox": {
                "lines": [
                  {
                    "element": "<body>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<h1>Main heading</h1>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<h2>Subheading</h2>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<h3>Sub-subheading</h3>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<h4>Header 4</h4>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<h5>Header 5</h5>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<h6>Header 6</h6>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</body>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "codeLang": "HTML",
                "outputCode": [
                  {
                    "type": "h1",
                    "content": "Main heading",
                    "style": {
                      "display": "block",
                      "fontSize": "2em",
                      "marginTop": "0.67em",
                      "marginBottom": "0.67em",
                      "marginLeft": "0",
                      "marginRight": "0",
                      "fontWeight": "bold"
                    }
                  },
                  {
                    "type": "h2",
                    "content": "Subheading",
                    "style": {
                      "display": "block",
                      "fontSize": "1.5em",
                      "marginTop": "0.83em",
                      "marginBottom": "0.83em",
                      "marginLeft": "0",
                      "marginRight": "0",
                      "fontWeight": "bold"
                    }
                  },
                  {
                    "type": "h3",
                    "content": "Sub-subheading",
                    "style": {
                      "display": "block",
                      "fontSize": "1.17em",
                      "marginTop": "1em",
                      "marginBottom": "1em",
                      "marginLeft": "0",
                      "marginRight": "0",
                      "fontWeight": "bold"
                    }
                  },
                  {
                    "type": "h4",
                    "content": "Heading 4",
                    "style": {
                      "display": "block",
                      "fontSize": "1em",
                      "marginTop": "1.33em",
                      "marginBottom": "1em",
                      "marginLeft": "0",
                      "marginRight": "0",
                      "fontWeight": "bold"
                    }
                  },
                  {
                    "type": "h5",
                    "content": "Heading 5",
                    "style": {
                      "display": "block",
                      "fontSize": "0.83em",
                      "marginTop": "1.67em",
                      "marginBottom": "1.67em",
                      "marginLeft": "0",
                      "marginRight": "0",
                      "fontWeight": "bold"
                    }
                  },
                  {
                    "type": "h6",
                    "content": "Heading 6",
                    "style": {
                      "display": "block",
                      "fontSize": "0.67em",
                      "marginTop": "1.67em",
                      "marginBottom": "1.67em",
                      "marginLeft": "0",
                      "marginRight": "0",
                      "fontWeight": "bold"
                    }
                  }
                ]
              }
            },
            {
              "sectionTitle": "פסקאות (Paragraphs)",
              "textBlock": [
                "כמו בעיתון מודפס, גם בעמוד אינטרנט אנחנו משתשמים פעמים רבות בתוכן מילולי. לצורך כך יש לרשותנו כמה רכיבי תוכן מילולי שלכל אחד יש תכונות ייחודיות."
              ],
              "listBlock": [
                "<p></p> - פסקה רגילה.",
                "<pre></pre> - פסקה מרובת שורות.",
                "<span></span> - תוכן מילולי מוחרג."
              ]
            },
            {
              "textBlock": [
                "בדומה לכותרות, גם פסקה היא רכיב block-level אשר תופס את כל רוחב המסך האפשרי. כמו כן, כל התוכן של הפסקה שיופיע בין תגית הפתיחה לתגית הסגירה גם הוא יישאף למלא את כל רוחב המסך ויירד  שורה רק כאשר התוכן מגיע לקצה רוחב המסך.",
                "סוג נוסף של תגית ליצירת פסקה אלה צמד התגיות <pre></pre>, אשר בין תגיות אלה אנחנו יכולים להכניס מלל עם שבירת שורות. כלומר נוכל להשתמש בסוג זה של פסקה כשאנחנו רוצים לשמור על תוכן מילולי עם שורות קצרות, כמו שיר לדוגמא.",
                "אם אנחנו רוצים להתייחס לקטע מסוים בתוך פסקה באופן שונה משאר הפסקה, לדוגמא להדגיש מילה אחת או כמה מילים, בהבלטה, בצבע שונה, בהטיית המלל, בקו תחתון, או כל סוג אחר של הדגשה שמחריג את המילים האלו משאר התוכן של הפסקה, אז אנחנו נשתמש בתגית span. תגית זו היא רכיב מסוג inline, שבשונה מהשתיים הקודמות זו תגית שכברירת מחדל אינה מתחילה שורה חדשה, והיא משתדלת, עד כמה שאפשר להשתלב בתוך שורה קיימת.",
                "אנחנו יכולים גם להוסיף תכונות עיצוב לרכיבי המלל השונים (ולרכיבי HTML בכלל). נעשה את זה פשוט על-ידי הוספת התכונה style בתוך תגית הפתיחה ונקבע את מאפיין העיצוב שאנו רוצים להכיל על הרכיב. אנחנו ניגע קלות בנושא של עיצוב עכשיו, אך יחידת הלימוד הבאה מוקדשת כולה לכל נושא העיצוב, ולכן שם אנחנו נכנס יותר לעומק לנושא זה."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body direction=\"rtl\">",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<div style='background-color: lightcyan'>",
                    "spaces": 2,
                    "color": "cyan.300"
                  },
                  {
                    "element": "<p>",
                    "spaces": 4,
                    "color": "cyan.300"
                  },
                  {
                    "element": "אספת עם גדולה שהשתתפו בה",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "<span style='font-weight: bold'>ארבעים אלף יהודים,</span>",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "קבלה החלטה הדורשת מאת בריטניה כי עליה להצהיר מחדש את רצונה להגשים את הצהרת בלפור.",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "</p>",
                    "spaces": 4,
                    "color": "cyan.300"
                  },
                  {
                    "element": "</div>",
                    "spaces": 2,
                    "color": "cyan.300"
                  },
                  {
                    "element": "<div style='background-color: lightgreen'>",
                    "spaces": 2,
                    "color": "green.300"
                  },
                  {
                    "element": "<pre>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "כשההוא אוהב את ההיא",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "תמיד הוא אומר לה,",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "חוזר ואומר לה",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "כמה היא אלוהית.",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "ורק אני מרוב אהבה",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "שותק.",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "</pre>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "</div>",
                    "spaces": 2,
                    "color": "green.300"
                  },
                  {
                    "element": "<div style=\"background-color: lightyellow; width: 400px;\">",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<p>",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "אספת עם גדולה שהשתתפו בה ארבעים אלף יהודים, קבלה החלטה הדורשת מאת בריטניה כי עליה להצהיר מחדש את רצונה להגשים את הצהרת בלפור.",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "</p>",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</div>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</body>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "p",
                    "content": [
                      {
                        "type": "span",
                        "content": "אספת עם גדולה שהשתתפו בה ",
                        "style": {}
                      },
                      {
                        "type": "span",
                        "content": "ארבעים אלף יהודים,",
                        "style": {
                          "fontWeight": "bold"
                        }
                      },
                      {
                        "type": "span",
                        "content": "\n קבלה החלטה הדורשת מאת בריטניה,\n כי עליה להצהיר מחדש את רצונה להגשים את הצהרת בלפור",
                        "style": {}
                      }
                    ],
                    "style": {
                      "direction": "rtl",
                      "backgroundColor": "lightcyan",
                      "marginTop": "1em",
                      "marginBottom": "1em",
                      "marginLeft": "0",
                      "marginRight": "0"
                    }
                  },
                  {
                    "type": "pre",
                    "content": "כשההוא אוהב את ההיא\nתמיד הוא אומר לה,\nחוזר ואומר לה\nכמה היא אלוהית.\nורק אני מרוב אהבה\nשותק.",
                    "style": {
                      "display": "block",
                      "fontFamily": "monospace",
                      "margin": "1em 0",
                      "whiteSpace": "pre",
                      "backgroundColor": "lightgreen",
                      "direction": "rtl"
                    }
                  },
                  {
                    "type": "p",
                    "content": "אספת עם גדולה שהשתתפו בה ארבעים אלף יהודים, קבלה החלטה הדורשת מאת בריטניה, כי עליה להצהיר מחדש את רצונה להגשים את הצהרת בלפור",
                    "style": {
                      "direction": "rtl",
                      "width": "40%",
                      "margin": "0 50%",
                      "backgroundColor": "lightyellow",
                      "marginTop": "1em",
                      "marginBottom": "1em",
                      "marginLeft": "0",
                      "marginRight": "0"
                    }
                  }
                ]
              }
            },
            {
              "textBlock": [
                "בבלוק הקוד שלמעלה אפשר לראות את השימוש בסוגי התגיות של פסקאות ואת השימוש בעיצוב. בפסקה הראשונה השתמשנו בתוך התוכן בתגית span על מנת להבליט חלק מהתוכן. בפסקה השנייה השתמשנו בתגית pre כדי ליצור פסקה עם שורות קצרות. בנוסף הוספנו רקע לפסקאות, וגם קבענו את רוחב הבלוק בחלקן, כדי לראות בצורה מוחשית את ההבדל בין בלוק מסוג block-level לבין בלוק מסוג inline.",
                "כמו כן, השתמשנו בבלוקים הכלליים div כדי להפריד בין הפסקאות ולעצב כל פסקה באופן ייחודי בעזרת הוספת התכונה style לכל אחד מהבלוקים."
              ],
              "frameClause": {
                "frameTitle": "עברית ואנגלית באינטרנט",
                "paragraphs": [
                  "דבר חשוב נוסף שכדאי להכיר הוא כיוון הכתיבה. כידוע ישנן שפות שנכתבות משמאל לימין, כמו אנגלית, ואחרות שנכתבות מימין לשמאל, כמו עברית. ברירת המחדל של מסמך HTML היא כיוון כתיבה משמאל לימין. לכן, אם ברצוננו לבנות אתר בשפה העברית עלינו להגדיר את כיוון הכתיבה לכל האתר. כדי לעשות זאת אנחנו יכולים להוסיף תכונה (Attribute) בתוך תג הפתיחה של ה-body עם הערך 'RTL' שמשמעותו Right To Left. באופן דומה אפשר גם להגדיר 'LTR', אבל זה כאמור ברירת המחדל."
                ]
              }
            },
            {
              "sectionTitle": "רשימות (Lists) ויחסי הורים-ילדים",
              "textBlock": [
                "כשעסקנו קודם בכותרות ופסקאות למדנו שיש צמד תגיות, פתיחה וסגירה, ובינהן התוכן שאנחנו רוצים להציג. אך ישנם רכיבים שלא מכילים בהכרח תוכן מילולי, אלא הם מכילים בתוך עצמם רכיבים אחרים. בדיוק כמו שאת הכותרות והפסקאות הכנסו לתוך תגי ה-<body>. רשימות הן סוג כזה של רכיבים, ואנחנו קוראים להם רכיבים מקוננים - Nested elements.",
                "אפשר להסתכל כמו על יחסים של הורה וילד. יש את תג הראשי, שהוא האבא (Parent), ובתוכו יש תגים משניים, שהם הילדים (Children). בתכנות אנחנו נוהגים להשתמש במושגים האלה כדי להמחיש את הרעיון של יחסים בין רכיבים שונים בעמוד האינטרנט.",
                "רשימות נחלקות לשני סוגים עיקריים. סוג אחד הוא רשימה של פריטים בדידים, כלומר שאין חשיבות לסדר של הפריטים (Unorder list). כמו לדוגמא רשימת מכולת. בשביל להגדיר אותה במסמך HTML אנחנו נשתמש בתגי האם <ul></ul> ובינהם נכניס את תגי הפריטים עצמם <li></li>, כאשר בינהם נרשום את התוכן המילולי שאנחנו רוצים להציג על המסך."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<ul>",
                    "spaces": 2,
                    "color": "red.300"
                  },
                  {
                    "element": "<li>Strawberry</li>",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<li>Orange</li>",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<li>Apple</li>",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</ul>",
                    "spaces": 2,
                    "color": "red.300"
                  },
                  {
                    "element": "</body>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "ul",
                    "content": [
                      {
                        "type": "li",
                        "content": "Strawberry",
                        "style": {
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0"
                        }
                      },
                      {
                        "type": "li",
                        "content": "Orange",
                        "style": {
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0"
                        }
                      },
                      {
                        "type": "li",
                        "content": "Apple",
                        "style": {
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0"
                        }
                      }
                    ],
                    "style": {
                      "listStyleType": "disc",
                      "paddingLeft": "40px"
                    }
                  }
                ]
              }
            },
            {
              "textBlock": [
                "הסוג השני שנכיר היא רשימה מסוג סדר, כלומר רשימה שבה לפריטים יש חשיבות היררכית או חשיבות של סדר מסוים בין הפריטים (Order list). את הרשימה הזאת אנחנו נגדיר באמצעות תגי האם <ol></ol>, וכמו בסוג הקודם של רשימה בינהם נוסיף את תגי הבן <li></li> ובתוכם את המלל שנרצה להוסיף ולהציג על הדפדפן."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body dir='rtl'>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<ol>",
                    "spaces": 2,
                    "color": "red.300"
                  },
                  {
                    "element": "<li>סבא</li>",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<li>אבא</li>",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<li>ילד</li>",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</ol>",
                    "spaces": 2,
                    "color": "red.300"
                  },
                  {
                    "element": "</body>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "ol",
                    "content": [
                      {
                        "type": "li",
                        "content": "סבא",
                        "style": {
                          "display": "list-item",
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0"
                        }
                      },
                      {
                        "type": "li",
                        "content": "אבא",
                        "style": {
                          "display": "list-item",
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0"
                        }
                      },
                      {
                        "type": "li",
                        "content": "ילד",
                        "style": {
                          "display": "list-item",
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0"
                        }
                      }
                    ],
                    "style": {
                      "listStyleType": "decimal",
                      "paddingRight": "40px",
                      "direction": "rtl"
                    }
                  }
                ]
              },
              "decorativeLine": true
            },
            {
              "sectionTitle": "זמן תרגול",
              "textBlock": [
                "אחרי שהכרנו את השלד, המבנה הבסיסי של כל עמוד אינטרנט באשר הוא, בשיעור הראשון. עשינו גם היכרות עם רכיבי מלל עיקריים בשיעור השני, הגיע העת לתרגל את מה שלמדנו עד כה.",
                "אז לפני התרגול הראשון צרו תיקייה חדשה ופיתחו אותה בתוכנת VS-Code שהורדתם בשיעורים הקודמים. בתוך התיקייה צרו תיקיית משנה עם שם השיעור ועבדו בתיקייה זו על התרגיל הקרוב (מומלץ להשתמש רק בשמות באנגלית).",
                "בתיקיית השיעור צרו קובץ חדש עם סיומת \"html.\" וכיתבו בקובץ זה את הקוד שלכם בהתאם להנחיית התרגיל."
              ]
            },
            {
              "sectionTitle": "תרגיל - עיתונות דיגיטלית",
              "textBlock": [
                "בתרגיל הראשון אתם מתבקשים לבחור כתבה מעיתון יומי מודפס ולהפוך אותה לדיגיטלית. אפשר לבחור כתבה אחת מתוך האפשרויות שמוצעות כאן, או לבחור כתבה קצרה אחרת מתוך אוסף העיתונות באתר הספריה הלאומית.",
                "שימו לב למבנה הכתבה ולשימוש בכותרות, פסקאות ורשימות (אם קיימות). דאגו להשתמש בכל מה שלמדתם עד עכשיו, בשיעור הראשון על מבנה מסמך HTML, וכל מה שלמדתם בשיעור השני על סוגי טקסטים. התאימו את הרכיבים השונים למה שאתם מוצאים בכתבה שבחרתם."
              ],
              "imagesGallery": [
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/article_davar_6-9-1929.png",
                  "altText": "עיתון דבר, 6.9.1929",
                  "imageSubject": "מבזקי חדשות קצרים לאחר מאורעות תרפ\"ט. מתוך עיתון \"דבר\".",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"דבר\", 6 בספטמבר 1929."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/article_davar_30-11-1947.png",
                  "altText": "כתבה מעיתון \"דבר\", 30.11.1947. הודעת דוד בן גוריון לאחר הצבעת החלוקה באו\"ם.",
                  "imageSubject": "דברי ראש הממשלה, דוד בן גוריון לאחר החלטת החלוקה של האו\"ם.",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"דבר\", תאריך:  30 בנובמבר 1947."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/article_palestinepost_30-11-1947.png",
                  "altText": "Article form Palstine Post, November 30th, 1947",
                  "imageSubject": "החגיגות של היהודים לאחר החלטת החלוקה של האו\"ם.",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"PALSTINE POST\", תאריך:  30 בנובמבר 1947."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/article_palestinepost_14-05-1948.png",
                  "altText": "Article from Palstine Post, May 14th, 1948.",
                  "imageSubject": "השידור הראשון של תחנת הרדיו \"קול ישראל\".",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"PALSTINE POST\", תאריך:  14 במאי 1948."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/article_haretz_17-5-1948.png",
                  "altText": "כתבה מעיתון \"הארץ\", 16.5.1948. מכירת בולים על ידי דואר ישראל.",
                  "imageSubject": "מכירת בולים ראשונים שהונפקו על-ידי דואר ישראל.",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"הארץ\", תאריך:  16 במאי 1948."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/davar_11-06-1948_army.png",
                  "altText": "כתבה מעיתון \"דבר\" על צבא ההגנה לישראל. 11.6.1948.",
                  "imageSubject": "מודעת בקשת תרומות לצבא ההגנה לישראל שמוקם ומתגבש בימיו הראשונים.",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"דבר\", 11 ביוני 1948."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/haaretz_21-05-1948_transportation-in-war.png",
                  "altText": "כתבה מעיתון \"הארץ\" על הוראות בדבר האפלת אורות הרכבים בזמן המלחמה. 21.5.1948.",
                  "imageSubject": "מודעה בעיתון הארץ עם הוראות מדויקות כיצד לעשות האפלה לפנסי הרכבים בזמן מלחמה.",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"הארץ\", 21 במאי 1948."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/haaretz_12-04-1961_eichman.png",
                  "altText": "כתבה מעיתון \"הארץ\" על משפט אייכמן. 12.4.1961.",
                  "imageSubject": "כתבה בעיתון \"הארץ\" על הבאתו של הצורר הנאצי אדולף אייכמן למשפט בישראל.",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"הארץ\", 12 באפריל 1961."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/haaretz_23-06-1948_rakevet-first.png",
                  "altText": "כתבה מעיתון \"הארץ\" 23.6.1947, רכבת ישראל נוסעת לראשונה.",
                  "imageSubject": "כתבה בעיתון \"הארץ\" על הנסיעה הראשונה של רכבת ישראל מתאריך ה-23.6.1947.",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"הארץ\", 23 ביוני 1948."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/haaretz_23-06-1948_tapuzim-rishonim.png",
                  "altText": "כתבה מעיתון \"הארץ\" 23.6.1948, תפוזים ראשונים הגיעו לירושלים.",
                  "imageSubject": "כתבה בעיתון \"הארץ\" תפוזים ראשונים הגיעו לירושלים בתאריך 23.6.1948.",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"הארץ\", 23 ביוני 1948."
                }
              ]
            },
            {
              "resources": [
                {
                  "title": "HTML text fundamentals / Article by MDN Web docs.",
                  "url": "https://developer.mozilla.org/en-US/docs/Learn/HTML/Introduction_to_HTML/HTML_text_fundamentals"
                },
                {
                  "title": "HTML Headings / Article by W3Schools.",
                  "url": "https://www.w3schools.com/html/html_headings.asp"
                },
                {
                  "title": "HTML Paragraphs / Article by W3Schools.",
                  "url": "https://www.w3schools.com/html/html_paragraphs.asp"
                },
                {
                  "title": "HTML Lists / Article by W3Schools.",
                  "url": "https://www.w3schools.com/html/html_lists.asp"
                },
                {
                  "title": "HTML Block and Inline Elements / Article by W3Schools",
                  "url": "https://www.w3schools.com/html/html_blocks.asp"
                },
                {
                  "title": "אוסף העיתונות בספריה הלאומית של ישראל.",
                  "url": "https://www.nli.org.il/he/newspapers/titles?"
                }
              ]
            }
          ]
        },
        {
          "lessonId": "2.3",
          "title": "חיבורים בין עולמות וקישורים (Links)",
          "sections": [
            {
              "sectionTitle": "חיבורים בין עולמות",
              "textBlock": [
                "בשיעור הקודם עסקנו בסוגים השונים של מלל, ואפילו יצרנו עמוד אינטרנט פשוט שחידשנו בו כתבה מהעבר. אבל האינטרנט מאפשר לנו הרבה יותר מזה. בשונה מהעיתונות המודפסת, באתר אינטרנט אנחנו יכולים לחבר ביתר קלות בין רעיונות שונים, מקורות מידע, דפים ואפילו אנשים.",
                "אז רגע לפני שנצלול לעומק השיעור, בואו נשחק משחק קטן עם קישורים, ונבדוק אילו חיבורים אנחנו יכולים לעשות במרחב האינטרנט."
              ],
              "frameClause": {
                "frameTitle": "משחק - מירוץ ויקיפדיה",
                "paragraphs": [
                  "מטרת המשחק להגיע מערך אחד לאחר בדרך הקצרה ביותר.",
                  "איך משחקים? מתחילים מערך אחד  שקובעים מראש, מגדירים ערך יעד שאליו רוצים להגיע בסוף, ומתחילים לחפש דרך הקישורים שמופיעים בכל ערך את הדרך לערך היעד שהוגדר מראש.",
                  "המנצח הוא זה שהגיע לערך היעד בדרך הכי קצרה (עם הכי פחות הקלקות).",
                  "ערכים שאפשר לבחור: תל-אביב - מדריד, נועה קירל - דוד בן גוריון, ליונל מסי - ערן זהבי ועוד כיד הדמיון הטובה."
                ]
              }
            },
            {
              "textBlock": [
                "אנחנו יכולים לקשר בין אזורים שונים בתוך העמוד שבו אנחנו צופים, לקשר בין עמודים שונים באתר שלנו, ואפילו לקשר בין אתרים שונים לחלוטין. למעשה, אם נחזור לדוגמא של העיתון, היכולת לקשר בין אלמנטים שונים, הופכת את האינטרנט למרחב ענק של ידע,עם אפשרויות כמעט בלתי מוגבלות.",
                "אז איך מוסיפים קישורים למסמך HTML שאנחנו בונים? פשוט מאוד, כמו לכל רכיב, גם לקישור יש תגיות משלו."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<a>HyperLink</a>",
                    "spaces": 0,
                    "color": "white"
                  }
                ]
              }
            },
            {
              "textBlock": [
                "אבל התגיות האלה לא מספיקות עדיין כדי שהקישור באמת יעבוד, אנחנו צריכים להגדיר בדיוק מה אנחנו רוצים שהקישור הייחודי הזה יעשה. מה הכוונה \"ייחודי\"? הכוונה היא שגם אם אנחנו רוצים להשתמש בכמה קישורים באתר שלנו, אנחנו לא רוצים שכל הקישורים יקשרו בדיוק לאותו יעד. לכל קישור יש את התפקיד שלו - או במילים אחרות, לכל קישור יש התכונות (Attributes) שלו.",
                "אז אילו תכונות יכולות להיות לקישור? בראש ובראשונה - יעד. הכי חשוב, לאן אנחנו רוצים שהקישור ינווט. קישור יכול לנווט למגוון של יעדים. כאמור, לדפי אינטרנט אחרים או לחלק אחר באותו עמוד, אבל קישור יכול גם לנווט להורדת קובץ, לשליחת דואר אלקטרוני, למספר טלפון ולעוד סוגים שונים של יעדים.",
                "אז כדי להגדיר לקישור את תכונת היעד אנחנו נוסיף בתוך התגית הפותחת את התכונה href, שזה למעשה קיצור של hyperlink reference, באופן הבא:"
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<a href=\"\">Go to Google</a>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "a",
                    "content": "Go to Google",
                    "style": {
                      "color": "blue",
                      "textDecoration": "underline",
                      "cursor": "pointer"
                    }
                  }
                ]
              }
            },
            {
              "sectionTitle": "נתיב מלא ונתיב יחסי",
              "textBlock": [
                "כשאנחנו מציינים את הנתיב שאליו אנחנו רוצים שהקישור יוביל, אנו יכולים לעשות את זה באחת משתי דרכים עיקריות."
              ],
              "listBlock": [
                "ניתוב מלא מתייחס לדרך המפורטת ביותר אל הפריט שאנחנו רוצים להוביל אליו. בניתוב מלא נשתמש לרוב כשאנחנו רוצים לנווט לעמודים שנמצאים מחוץ לאתר שלנו.",
                "ניתוב יחסי מציין את המיקום היחסי של היעד שאנחנו רוצים להגיע אליו ביחס למיקום של העמוד שהקישור מופיע בו. אם נתייחס לדוגמא של מבנה התיקיות שמופיע למטה, ונרצה לקשר בין העמוד index.html שנמצא בתיקייה הראשית של הפרויקט, לעמוד about.html שנמצא בתוך התיקייה about, אז לא נצטרך לכתוב את הנתיב המלא של היעד, אלא נוכל להסתפק בנתיב היחסי באופן הבא: 'about/about.html/'."
              ],
              "codeBox": {
                "codeLang": "Files structure",
                "lines": [
                  {
                    "element": "root",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "index.html",
                    "spaces": 1,
                    "color": "white"
                  },
                  {
                    "element": "/about",
                    "spaces": 1,
                    "color": "white"
                  },
                  {
                    "element": "about.html",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "/images",
                    "spaces": 1,
                    "color": "white"
                  },
                  {
                    "element": "/contact",
                    "spaces": 1,
                    "color": "white"
                  }
                ]
              }
            },
            {
              "sectionTitle": "קישור פנימי וקישור חיצוני",
              "textBlock": [
                "תכונה (Attribute) נוספת שחשוב להכיר כשמגדירים קישור היא אופן הפעולה של הניווט. כלומר האם הקישור יפתח באותו חלון, בחלון חדש, בלשונית (tab) חדשה, או במסגרת מוגדרת בתוך העמוד הנצפה.",
                "את התכונה הזאת אנחנו מגדירים באמצעות התכונה target שיכולה לקבל מספר ערכים, כשהשימושיים בינהם הם אלה:"
              ],
              "listBlock": [
                "\"self_\"  - ערך ברירת המחדל של קישור. משמעותו היא שהקישור נפתח באותו עמוד שהוא הקישור נמצא. בתכונה הזאת אנחנו בדרך כלל נשתמש עבור קישורים פנימיים בתוך האתר שלנו. למשל לעמוד אחר באתר שלו או לחלק אחר בתוך העמוד. כמו כן, מכיוון שזו התנהגות ברירת המחדל של קישור, אנחנו לא חייבים להוסיף אותה.",
                "\"blank_\" - הערך הזה יגרום לקישור להיפתח בחלון חדש או בלשונית (tab) חדשה של הדפדפן. באפשרות זו אנחנו נעדיף להשתמש עבור קישורים חיצוניים, כלומר קישורים שמנווטים מחוץ לאתר שלנו, לאתרים אחרים. "
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<a href=\"https://www.google.com\" target=\"_blank\">Go to Google</a>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<a href=\"https://www.my-site.com\" target=\"_self\">About me</a>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "a",
                    "content": "Go to Google",
                    "style": {
                      "href": "",
                      "target": "_blank",
                      "color": "blue",
                      "textDecoration": "underline",
                      "cursor": "pointer"
                    }
                  },
                  {
                    "type": "a",
                    "content": "About me",
                    "style": {
                      "href": "",
                      "target": "_self",
                      "color": "blue",
                      "textDecoration": "underline",
                      "cursor": "pointer"
                    }
                  }
                ]
              }
            },
            {
              "sectionTitle": "קישורים במרחב",
              "textBlock": [
                "אם פתחתם את תצוגת הפלט של דוגמת הקוד האחרונה כאן, יכולתם בוודאי לראות ששני הקישורים שהוספנו התמקמו באותה שורה, בזה אחר זה. ההתנהגות הזו שונה מכפי שראינו בשיעור הקודם כשלמדנו על כותרות, פסקאות ורשימות. ההבדל הוא במאפיינים השונים של כל אחד מהרכיבים הללו. ישנם רכיבים שכברירת מחדל תופסים את כל רוחב הדף, מה שנקרא block (גם אם התוכן לא), ואז רכיבים אחרים שבאים אחריהם יתמקמו שורה אחת מתחתיהם. וישנם רכיבים שמתמקמים בתוך השורה, מה שנקרא inline, כלומר הם ישתלבו בתוך שורה, במידת האפשר.",
                "משום כך, ברכיבי inline אנחנו יכולים להשתמש גם בצורה עצמאית במרחב הדף, וגם בתוך רכיבים אחרים. לדוגמא לשלב קישור בתוך פסקה, רשימה, כותרת או כל רכיב אחר."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<p>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "אספת עם גדולה שהשתתפו בה ארבעים אלף יהודים, קבלה החלטה הדורשת מאת ",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "<a href=\"https://www.my-site.com\">בריטניה,</a>",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": " כי עליה להצהיר מחדש את רצונה להגשים את הצהרת בלפור.",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "</p>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "p",
                    "content": [
                      {
                        "type": "span",
                        "content": "אספת עם גדולה שהשתתפו בה ארבעים אלף יהודים, קבלה החלטה הדורשת מאת ",
                        "style": {}
                      },
                      {
                        "type": "a",
                        "content": "בריטניה,",
                        "style": {
                          "color": "blue",
                          "href": "#",
                          "textDecoration": "underline",
                          "cursor": "pointer"
                        }
                      },
                      {
                        "type": "span",
                        "content": " כי עליה להצהיר מחדש את רצונה להגשים את הצהרת בלפור.",
                        "style": {}
                      }
                    ],
                    "style": {
                      "display": "block",
                      "direction": "rtl",
                      "marginTop": "1em",
                      "marginBottom": "1em",
                      "marginLeft": "0",
                      "marginRight": "0"
                    }
                  }
                ]
              },
              "decorativeLine": true
            },
            {
              "sectionTitle": "זמן תרגול",
              "textBlock": [
                "לסיכום, הכרנו בשיעור הזה את אחת התגיות הכי חשובות ושימושיות בתהליך בניית אתר. אפשר לומר שבלי קישורים האתר יהיה דומה יותר לספר, או לעיתון. הקישורים מאפשרים לנו לנווט בקלות במרחב העמוד, האתר והאינטרנט בכלל.",
                "התרגיל של השיעור הזה יהיה המשך ישיר לתרגיל הקודם. הוסיפו למאמר שבחרתם ויצרתם ממנו עותק דיגיטלי קישורים בתוך הטקסט, והפכו את הכתבה שהשתמשתם לקטע בסגנון ויקיפדיה. כלומר ביחרו מילים מסוימות וקשרו בעזרתן את הטקסט שלכם למקורות נוספים ברחבי האינטרנט. ",
                "לדוגמא, אם בחרתם בטקסט כמו זה:"
              ],
              "frameClause": {
                "frameTitle": "",
                "paragraphs": [
                  "צ'רצ'יל אמר באספה אחת שנערכה בוואנקובר, קנדה, שאין כל גורם שיפריע ליהודים והערבים לחיות זה על יד זה. היהודים הביאו לא\"י עושר רב ותרבות, אף מפלגה  בריטית לא תסתלק מן ההתחייבויות כלפי התנועה הציונית בימי המלחמה."
                ]
              }
            },
            {
              "textBlock": [
                "אתם יכולים להפוך את המילה \"צ'ר'צ'יל\" לקישור ולשלוח את המשתמש לעמוד בויקיפדיה שמפרט מי הוא היה. או לבחור את המילה \"קנדה\" ולקשר אותה למקור מידע קשור כפי ראות עיניכם. אפשר גם כמובן להפוך כמה מילים ביחד לקישור אחד.",
                "מתוך הכתבה שברשותכם צרו לפחות 7 קישורים."
              ]
            },
            {
              "resources": [
                {
                  "title": "Creating hyperlinks / Article by MDN Web docs",
                  "url": "https://developer.mozilla.org/en-US/docs/Learn/HTML/Introduction_to_HTML/Creating_hyperlinks"
                },
                {
                  "title": "The Anchor element / Article by MDN Web docs",
                  "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Element/a"
                },
                {
                  "title": "HTML Link / Article by W3Schools",
                  "url": "https://www.w3schools.com/html/html_links.asp"
                },
                {
                  "title": "HTML Attributes / Article by W3schools",
                  "url": "https://www.w3schools.com/html/html_attributes.asp"
                }
              ]
            }
          ]
        },
        {
          "lessonId": "2.4",
          "title": "יצירת טבלה (Tables)",
          "sections": [
            {
              "sectionTitle": "טבלאות (Tables)",
              "textBlock": [
                "בשיעורים הקודמים למדנו על סוגים שונים של הצגת תוכן מילולי בעמוד אינטרנט, ואפילו יצרנו כתבה דיגיטלית עם כותרות, פסקאות, ואולי גם השתמשנו ברשימות בכתבה שיצרנו. אבל הצורות של הן לא הצורות היחידות שאפשר להציג מילים באתר. בשיעור הקרוב נלמד איך בונים טבלה במסמך HTML, וגם נדאג כמובן שהיא תופיע בעמוד האינטרנט בדפדפן.",
                "כמו שכבר הכרנו, שפת HTML היא שפה של תגיות. לכן גם לטבלה יש את התגית שלה. בעצם, לא רק תגית אחת, אלא כדי ליצור טבלה אנחנו צריכים להכיר סט של תגיות. למעשה, לכל תכונה בטבלה יש תגית משלה. לכותרת הטבלה, לשורה בטבלה, לתא בודד, לשורת כותרות וכדומה. כל דבר כזה צריך להיות מוגדר בפני עצמו.",
                "כדי ליצור טבלה אנחנו צריכים להשתמש בתגיות מעטפת ותגיות פנימיות, כמו שלמדנו בשיעורים הקודמים על יצירת רשימה. תגיות המעטפת של טבלה הן <table></table>. תגיות בסיסיות נוספות שמרכיבות טבלה הן אלה:"
              ],
              "listBlock": [
                "<table></table> - הבלוק הראשי שמכיל את כל התוכן של הטבלה.",
                "<caption></caption> - כותרת הטבלה. התוכן שנזין בין תגים אלה יופיע בראש הטבלה.",
                "<td></td> - תא בודד בתוך הטבלה. זה הוא למעשה הרכיב הקטן ביותר בבלוק הטבלה.",
                "<tr></tr> - שורה בודדת בטבלה. בלוק זה יכיל מספר תאים.",
                "<th></th> - תא בודד של כותרת בטבלה. כלומר בתגית זו אנחנו נשתמש כשנרצה לקבוע שתא מסוים, שורת תאים או עמודת תאים, משמשים ככותרות"
              ]
            },
            {
              "textBlock": [
                "בקוד שלהלן אנחנו יכולים לראות דוגמא לטבלה עם שלוש שורות ושתי עמודות. השורה העליונה היא שורת כותרות, ועוד שתי שורות תוכן. העתיקו את את הקוד לעורך הקוד במחשבכם כדי לראות את התוצאה."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<table>",
                    "spaces": 2,
                    "color": "red.300"
                  },
                  {
                    "element": "<caption>Types of vegetables and fruits</caption>",
                    "spaces": 4,
                    "color": "orange.300"
                  },
                  {
                    "element": "<tr>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "<th>Fruits</th>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<th>Vegetables</th>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</tr>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "<tr>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "<td>Tomato</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td>Carrot</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</tr>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "<tr>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "<td>Orange</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td>Lettuce</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</tr>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "</table>",
                    "spaces": 2,
                    "color": "red.300"
                  },
                  {
                    "element": "</body>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "table",
                    "content": [
                      {
                        "type": "caption",
                        "content": "Types of vegetables and fruits",
                        "style": {}
                      },
                      {
                        "type": "thead",
                        "content": [
                          {
                            "type": "tr",
                            "content": [
                              {
                                "type": "th",
                                "content": "Fruits",
                                "style": {}
                              },
                              {
                                "type": "th",
                                "content": "Vegetables",
                                "style": {}
                              }
                            ],
                            "style": {}
                          }
                        ],
                        "style": {}
                      },
                      {
                        "type": "tbody",
                        "content": [
                          {
                            "type": "tr",
                            "content": [
                              {
                                "type": "td",
                                "content": "Tomato",
                                "style": {}
                              },
                              {
                                "type": "td",
                                "content": "Carrot",
                                "style": {}
                              }
                            ],
                            "style": {}
                          },
                          {
                            "type": "tr",
                            "content": [
                              {
                                "type": "td",
                                "content": "Orange",
                                "style": {}
                              },
                              {
                                "type": "td",
                                "content": "Lettuce",
                                "style": {}
                              }
                            ],
                            "style": {}
                          }
                        ],
                        "style": {}
                      }
                    ],
                    "style": {}
                  }
                ]
              }
            },
            {
              "sectionTitle": "מיזוג תאים - colspan & rowspan",
              "textBlock": [
                "לפעמים אנחנו נרצה למזג מספר תאים לתא אחד, כך שתא מסוים בטבלה יתפוס מספר שורות או מספר עמודות. כדי לעשות את זה בקוד אנחנו צריכים להוסיף תכונה (Attribute) לתא המבוקש, ולציין את מספר השורות או העמודות שאנחנו רוצים שהוא יתפוס."
              ],
              "listBlock": [
                "colspan - נשתמש בתכונה זו עבור תא בודד מתוך הטבלה, והערך שמוזן לתכונה זו הוא מספר המציין את מספר העמודות שהתא יתפרש עליהן.",
                "rowspan - נשתמש בתכונה זו עבור תא בודד מתוך הטבלה, והערך שמוזן לתכונה זו הוא מספר המציין את מספר השורות שהתא יתפרש עליהן."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body dir='rtl'>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<table>",
                    "spaces": 2,
                    "color": "red.300"
                  },
                  {
                    "element": "<caption>Weekly schedule</caption>",
                    "spaces": 4,
                    "color": "orange.300"
                  },
                  {
                    "element": "<tr>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "<th></th>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<th>Sunday</th>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<th>Monday</th>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<th>Tuesday</th>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</tr>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "<tr>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "<td>8:00</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td rowspan=2>Math</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td>Arts</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td>Sport</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</tr>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "<tr>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "<td>12:00</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td>English</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td>Finnance</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</tr>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "<tr>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "<td>14:00</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td>Geography</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td>History</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</tr>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "</table>",
                    "spaces": 2,
                    "color": "red.300"
                  },
                  {
                    "element": "</body>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "table",
                    "content": [
                      {
                        "type": "caption",
                        "content": "Weekly schedule",
                        "style": {}
                      },
                      {
                        "type": "tr",
                        "content": [
                          {
                            "type": "th",
                            "content": "",
                            "style": {}
                          },
                          {
                            "type": "th",
                            "content": "Sunday",
                            "style": {}
                          },
                          {
                            "type": "th",
                            "content": "Monday",
                            "style": {}
                          },
                          {
                            "type": "th",
                            "content": "Tuesday",
                            "style": {}
                          }
                        ],
                        "style": {}
                      },
                      {
                        "type": "tr",
                        "content": [
                          {
                            "type": "td",
                            "content": "8:00",
                            "style": {}
                          },
                          {
                            "type": "td",
                            "content": "Math",
                            "style": {
                              "rowspan": "2"
                            }
                          },
                          {
                            "type": "td",
                            "content": "Arts",
                            "style": {}
                          },
                          {
                            "type": "td",
                            "content": "Sport",
                            "style": {}
                          }
                        ],
                        "style": {}
                      },
                      {
                        "type": "tr",
                        "content": [
                          {
                            "type": "td",
                            "content": "12:00",
                            "style": {}
                          },
                          {
                            "type": "td",
                            "content": "",
                            "style": {}
                          },
                          {
                            "type": "td",
                            "content": "English",
                            "style": {}
                          },
                          {
                            "type": "td",
                            "content": "Finnance",
                            "style": {}
                          }
                        ],
                        "style": {}
                      },
                      {
                        "type": "tr",
                        "content": [
                          {
                            "type": "td",
                            "content": "14:00",
                            "style": {}
                          },
                          {
                            "type": "td",
                            "content": "Geography",
                            "style": {}
                          },
                          {
                            "type": "td",
                            "content": "History",
                            "style": {
                              "rowspan": "2"
                            }
                          },
                          {
                            "type": "td",
                            "content": "",
                            "style": {}
                          }
                        ],
                        "style": {}
                      }
                    ],
                    "style": {
                      "width": "50%"
                    }
                  }
                ]
              }
            },
            {
              "sectionTitle": "סמנטיקה בתוך טבלה (Semantics Tags)",
              "textBlock": [
                "מלבד התגיות שהכרנו עתה שמאפשרות לנו ליצור טבלה במסמך HTML, ולהציגה בדפדפן, קיימות תגיות נוספות שחשוב להכיר אשר ,תפקידן הוא בעיקר לחלק את הטבלה לאזורים מוגדרים, דבר שיכול לעזור לעצב את הטבלה. נלמד יותר לעומק על עיצוב העמוד בהמשך הקורס, אך עכשיו רק נתמקד בתגיות הבאות."
              ],
              "listBlock": [
                "<thead></thead> - תג זה מציין את החלק העליון בטבלה. ברוב הפעמים התגית הזאת תעטוף את השורה הראשונה של הטבלה, שורת הכותרות.",
                "<tfoot></tfoot> - תג זה מציין את החלק התחתון בטבלה. לרוב נשתמש בתג הזה כאשר יש לנו איזו שורת סיכום או שורה תחתונה אחרת שהיא שונה משאר השורות של גוף הטבלה.",
                "<tbody></tbody> - תג זה מציין את החלק העיקרי של הטבלה. כלומר בשונה משני התגים האחרים, בתג הזה אנחנו תמיד נשתמש כדי לציין את התוכן העיקרי של כל הטבלה. "
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<table>",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "<caption>Incomes vs Outcomes<caption>",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "<thead>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<tr>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<th>Incomes</th>",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "<th>Outcomes</th>",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "</tr>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "</thead>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<tbody>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<tr>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<td>500</td>",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "<td>200</td>",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "</tr>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<tr>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<td>300</td>",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "<td>50</td>",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "</tr>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "</tbody>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<tfooter>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<tr>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<td>200</td>",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "<td>150</td>",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "</tr>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "</tfooter>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</table>",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "</body>",
                    "spaces": 0,
                    "color": "white"
                  }
                ]
              },
              "decorativeLine": true
            },
            {
              "sectionTitle": "זמן תרגול - עיתונות דיגיטלית",
              "textBlock": [
                "גם בתרגיל הזה, כמו בקודמים, אנחנו נעבוד עם כתבת עיתון היסטורית ונהפוך אותה לכתבה דיגיטלית. הפעם נעשה זאת כדי לתרגל את מה שלמדנו בשיעור האחרון - יצירת טבלה.",
                "בגלריה שבתרגיל זה מוצגים מספר גזרי עיתונים מהעבר מכל מיני תחומים: תחזית מזג אוויר, לוח הצגות בתאטרון, לוח שידורים ברדיו וכדומה. בחרו קטע אחד כפי רצונכם וצרו ממנו טבלה בעזרת התגיות שלמדתם בשיעור כך שתוכלו להציגה בעמוד האינטרנט שלכם."
              ],
              "imagesGallery": [
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson4/davar_11-06-1948_radio.png",
                  "altText": "לוח שידורי רדיו, מתוך עיתון דבר, יוני 1948",
                  "imageSubject": "לוח שידורי תחנת הרדיו \"קול ישראל\" בעיתון \"דבר\".",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"דבר\", 11 ביוני 1948."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson4/davar_11-06-1948_teather.png",
                  "altText": "לוח הצגות תאטרון, מתוך עיתון דבר, יוני 1948",
                  "imageSubject": "לוח הצגות שבועי בתאטרון הקאמרי בעיתון \"דבר\".",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"דבר\", 11 ביוני 1948."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson4/davar_28-11-1947_weather.png",
                  "altText": "תחזית מזג אוויר, מתוך עיתון דבר, נובמבר 1947",
                  "imageSubject": "תחזית מזג אויר שבועית בעיתון \"דבר\".",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"דבר\", 28 בנובמבר 1947."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson4/palstinepost_28-11-1947_departures.png",
                  "altText": "לוח המראות ולוח הפלגות שפורסמו בעיתון Palestine Post.",
                  "imageSubject": "לוח המראות משדה תעופה לוד, ולוח הפלגות מנמל חיפה, שפורסמו בעיתון ה-Palstine Post, ב-28 בנובמבר 1947",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"Palstine Post\", 28 בנובמבר 1947."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson4/haaretz_14-09-1952_basketball.png",
                  "altText": "טבלת ליגת הכדורסל של תל אביב מתוך עיתון הארץ.",
                  "imageSubject": "טבלת ליגת הכדורסל במדור הספורט של עיתון \"הארץ\".",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"הארץ\", 14 בספטמבר 1952."
                }
              ]
            },
            {
              "resources": [
                {
                  "title": "HTML Table basics / Article by MDN web docs",
                  "url": "https://developer.mozilla.org/en-US/docs/Learn/HTML/Tables/Basics"
                },
                {
                  "title": "HTML Table advanced features and accessibility / Article by MDN web docs",
                  "url": "https://developer.mozilla.org/en-US/docs/Learn/HTML/Tables/Advanced"
                },
                {
                  "title": "HTML Tables / Article by W3Schools",
                  "url": "https://www.w3schools.com/html/html_tables.asp"
                },
                {
                  "title": "אוסף העיתונות בספריה הלאומית של ישראל",
                  "url": "https://www.nli.org.il/he/newspapers/titles?"
                }
              ]
            }
          ]
        },
        {
          "lessonId": "2.5",
          "title": "אובייקטים חזותיים ושמעתיים (Images, Videos & Audios)",
          "sections": [
            {
              "sectionTitle": "אובייקטים חזותיים - לא רק מילים",
              "textBlock": [
                "יש משפט שאומר שתמונה שווה אלף מילים. ואכן, פעמים רבות אנחנו יכולים למצוא בעיתונים הישנים לצד הכתבות תמונות בשחור לבן או בצבע שנותנות נקודת מבט נוספת על מה שכתוב. התמונה יכולה גם להמחיש את מה שמתואר באותה כתבה. "
              ],
              "image": {
                "url": "/images/lessonsContents/module2/lesson5/jerusalem_1968.jpg",
                "altText": "View of Jerusalem in 1968",
                "descText": "רשומה זו היא חלק מפרויקט רשת ארכיוני ישראל (רא\"י) וזמינה במסגרת שיתוף פעולה בין ארכיון בית השיטה, משרד ירושלים ומורשת והספריה הלאומית של ישראל.",
                "width": [
                  300,
                  400,
                  500
                ]
              }
            },
            {
              "textBlock": [
                "גם באתרי אינטרנט, סביר להניח שכבר ראיתם בעצמכם, משתמשים באופן נרחב מאוד בתמונות. כמעט לכל כתבה באתר אקטואליה, ספורט או אפילו רכילויות הכתבים דואגים לצרף תמונות בתוך הכתבות שלהם. קרוב לודאי שיצא לכם להעלות תמונה שלכם לפייסבוק או לאינסטגרם, אחרי שעברתם חוויה שרציתם לשתף עם אחרים, אולי גם צירפתם לתמונה כמה מילים על מה שחוויתם. ",
                "יתר על כן, לאתרי אינטרנט יש יתרון בולט נוסף על פני המדיה המודפסת. שכן בעמוד אינטרנט לא מוכרחים להציג רק תמונות סטטיות, מכיוון שהאינטרנט מאפשר לנו להציג קטעי וידאו קצרים (או ארוכים) ולהטמיע אותם במקומות שונים באתר. בתוך הכתבה, לצידה, או אפילו בחלק נפרד לחלוטין.",
                "אז בואו נתחיל ללמוד איך עובדים עם תמונות וקטעי וידאו בעמודי אינטרנט."
              ]
            },
            {
              "sectionTitle": "תמונות (Images)",
              "textBlock": [
                "בשונה מהתגיות שהכרנו בשיעורים הקודמים, לתמונה אין תגית פותחת ותגית סוגרת, אלא יש לה תגית אחת בלבד, והיא לא יכולה להכיל רכיבי משנה בתוכה. כמו כן, בדומה לתגית של יצירת קישור שלמדנו, גם לתגית תמונה יש תכונות (Attributes) הכרחיות לצורך הגדרתה, ועוד כמה תכונות אופציונליות.",
                "אז בואו ונכיר את התגית ואז נסביר עליה בהרחבה."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body>",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "<img src='/images/jerusalem_1968.jpg' alt='View of Jerusalem in 1968' />",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "</body>",
                    "color": "white",
                    "spaces": 0
                  }
                ]
              }
            },
            {
              "listBlock": [
                "מקור התמונה (src, קיצור של Source) - תכונה זו מגדירה את הנתיב שממנו אנחנו רוצים להטמיע את התמונה בעמוד ה-HTML שאנחנו בונים. באופן דומה לדרך בה אנחנו מגדירים קישורים באמצעות התכונה href, גם עבור תמונה אנחנו יכולים להשתמש בנתיב המלא של התמונה, או בנתיב יחסי.",
                "טקסט חלופי (alt, קיצור של Alternate) - תכונה זו היא הכרחית בהגדרת התמונה, משתי סיבות עיקריות. הסיבה הראשונה נובעת מעניין טכני, למקרה שעלולה לקרות תקלה באתר, לדוגמא כישלון בטעינה תמונות, או טעינה איטית מדי. במקרה כזה במקום התמונה יופיע הטקסט החלופי שמוגדר באותה תגית. הסיבה השניה הנובעת מעניין של נגישות האתר. כאשר קוראי מסכים (Screen readers) ומנועי חיפוש (Search Engines) עוברים על הרכיבים הקיימים בעמוד, ויודעים לזהות את מה שמוצג בתמונות לפי הטקסט החלופי שאנחנו מגדירים.",
                "כותרת תמונה (title) - באמצעות תכונה זו אנחנו יכולים כותרת לתמונה שתופיעה בעת ריחוף של העכבר (hover) על גבי התמונה. חשוב לציין שתכונה זו אינה הכרחית ולא נמצאת בשימוש נרחב, מכיוון שהיא לא נתמכת על-ידי חלק מהדפדפנים, וגם עשויה להוות בעיה ולבלבל קוראי מסכים (Screen Readers) בפענוח תוכן העמוד, לכן ההמלצה היא שלא להשתמש בתכונה זו."
              ]
            },
            {
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body>",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "<img",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "src='/images/jerusalem_1968.jpg'",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "alt='View of Jerusalem in 1968'",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "width='800px'",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "height='600px'",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "title='View of Jerusalem in 1968'",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "/>",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "</body>",
                    "color": "white",
                    "spaces": 0
                  }
                ]
              }
            },
            {
              "listBlock": [
                "מימדי התמונה - שתי תכונות שהן אמנם לא הכרחיות, אך חשובות מאוד, הן רוחב (width) וגובה (height) התמונה. אם נוסיף תמונה למסמך ה-HTML שלנו ולא נגדיר את המימדים שאנחנו רוצים, אז התמונה תופיע כברירת המחדל בגודל המקורי שלה. לפעמים זה עלול להשתלב בצורה לא מותאמת עם תכנים אחרים בעמוד. לכן כדאי להגדיר את מימדי התמונה בעצמנו. יחד עם זאת, אנחנו לא חייבים להגדיר גם הרוחב וגם את הגובה של התמונה, אלא מספיק שנגדיר את רוחבה, והגובה ישתנה בהתאם לפרופורציה של הגודל המקורי. כמובן שאם אנחנו מחליטים להגדיר גם את הרוחב וגם את הגובה, כדאי לבדוק את הפרופורציות המקוריות של התמונה ולהגדיר את המימדים באותן פרופורציות, כדי להמנע מעיוות התמונה. "
              ],
              "frameClause": {
                "frameTitle": "אופטימיזציה (Optimization)",
                "paragraphs": [
                  "בעת שאנחנו משתמשים בתמונות באתר, חשוב להבין ולקחת בחשבון את משקל התמונה. תמונות, בשונה מתוכן מילולי עשויות להיטען לאט יותר בעמוד, מה שיכול לגרום למצב שכל התוכן של העמוד נטען מהר מאוד ורק לאחר כמה שניות התמונות מופיעות.",
                  "ישנן מספר דרכים לייעל את תהליך טעינת העמוד, ולעבוד עם תמונות בצורה אופטימלית. הדרך הכי פשוטה היא להשתמש בתמונות קטנות יחסית שלא שוקלות הרבה. אבל ישנן דרכים נוספות שנלמד עליהן בהמשך הקורס ובקורסים מתקדמים יותר."
                ]
              }
            },
            {
              "sectionTitle": "קטעי וידאו וקול (Videos & Audios)",
              "textBlock": [
                "בקורס הזה אנחנו לא נעמיק את הלמידה בנושא הטמעת קבצי קול וקבצי וידאו בעמוד אינטרנט, אלא רק נציין בקצרה את התגיות שמאפשרות להטמיע קבצים מסוג זה. מלבד זאת, עלינו לזכור את שציינו בתחילת השיעור הזה כשדיברנו על תמונות. ככל שהרכיבים שאנחנו משתמשים בהם באתר שלנו הם בעלי משקל רב יותר, אז הביצועים של האתר עלולים להיפגם, על אחת כמה וכמה כשאנחנו מדברים על קבצי קול, ולבטח קבצי וידאו, שלרוב אלה קבצים כבדים כדאי לחשוב לפני שאנחנו מטמיעים קובץ וידאו באתר, ואולי הדרך העדיפה לעשות את זההיא באמצעות ספק חיצוני, כמו YouTube, Vimeo, או כל שירות סטרימינג אחר שיכול לאחסן קבצי וידאו.",
                "אז כדי להטמיע קובץ וידאו בעמוד, אנחנו יכולים להשתמש בתגית <video></video>, כשבתוך תגית הפתיחה נציין את כל התכונות שאנחנו רוצים להגדיר בעזרתן את הוידאו, ובין תגית הפתיחה לתגית הסגירה נוסיף לפחות שני מקורות לוידאו (אך כמובן אם אנחנו משתמשים בספק חיצוני לוידאו, אז עניין זה פחות הכרחי."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body>",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "<video controls width='250px'>",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "<source src='source-video.mp4' />",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "<source src='source-video.webm' />",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "</video>",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "<body>",
                    "color": "white",
                    "spaces": 0
                  }
                ]
              }
            },
            {
              "textBlock": [
                "בשביל להטמיע קובץ קול, נשתמש באותו אופן כמו בוידאו, וכאן אפשר גם להכניס את מקור הקובץ בתוך התגית הפותחת."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<audio src='audioFile.mp3' controls></audio>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</body>",
                    "spaces": 0,
                    "color": "white"
                  }
                ]
              }
            },
            {
              "textBlock": [
                "להרחבה והעמקה של הנושא ניתן לראות ברשימת המקורות בתחתית עמוד זה."
              ],
              "decorativeLine": "true"
            },
            {
              "sectionTitle": "זמן תרגול",
              "textBlock": [
                "הגיע הזמן להמשיך להרחיב את הפרויקט המתמשך שהתחלנו בשיעורים הקודמים. עכשיו הגיע הזמן להוסיף קצת צבע (או שחור-לבן) לכתבה שבחרתם.",
                "היכנסו לאוסף התמונות של הספריה הלאומית (קישור נמצא ברשימת המקורות כאן), חפשו שתי תמונות שמתאימות לתוכן הכתבה שבחרתם והוסיפו אותן לעמוד שיצרתם.",
                "תמונה אחת צריכה להיות תמונת נושא שתופיעה מתחת לכותרת הכתבה ויחסית בגדול, והתמונה השנייה תהיה תמונת תוכן, קטנה יותר במימדיה, והיא תופיעה בין הפסקאות של הכתבה. הפעילו שיקול דעת ותכננו את מבנה הכתבה לפי תבונתכם."
              ]
            },
            {
              "resources": [
                {
                  "title": "Images in HTML / Article by MDN web docs",
                  "url": "https://developer.mozilla.org/en-US/docs/Learn/HTML/Multimedia_and_embedding/Images_in_HTML"
                },
                {
                  "title": "Video and audio content / Article by MDN web docs",
                  "url": "https://developer.mozilla.org/en-US/docs/Learn/HTML/Multimedia_and_embedding/Video_and_audio_content"
                },
                {
                  "title": "HTML Video / Article by W3Schools",
                  "url": "https://www.w3schools.com/html/html5_video.asp"
                },
                {
                  "title": "התמונה של ירושלים מתחילת השיעור מתוך אוסף התמונות של הספריה הלאומית של ישראל",
                  "url": "https://www.nli.org.il/he/archives/NNL_ARCHIVE_AL997009875765405171/NLI#$FL77606146"
                },
                {
                  "title": "אוסף התמונות של הספריה הלאומית של ישראל",
                  "url": "https://www.nli.org.il/he/search?projectName=NLI#&q=any,contains,NNL&bulkSize=60&index=60&sort=rank&multiFacets=facet_local50,include,%D7%A9%D7%99%D7%9E%D7%95%D7%A9%20%D7%9E%D7%95%D7%AA%D7%A8%20%D7%9C%D7%9C%D7%90%20%D7%9B%D7%9C%20%D7%9E%D7%92%D7%91%D7%9C%D7%94,1|,|facet_local50,include,%D7%A9%D7%99%D7%9E%D7%95%D7%A9%20%D7%9E%D7%95%D7%AA%D7%A8%20%D7%9C%D7%9E%D7%98%D7%A8%D7%94%20%D7%9C%D7%90-%D7%9E%D7%A1%D7%97%D7%A8%D7%99%D7%AA,1&t=photos"
                }
              ]
            }
          ]
        },
        {
          "lessonId": "2.6",
          "title": "המבנה האנטומי של עמוד HTML5 - חלק שני (Semantics Boxes)",
          "sections": [
            {
              "sectionTitle": "בלוקים סמנטיים ב-HTML5",
              "textBlock": [
                "בשיעור הראשון של הקורס הזה למדנו לחלק את העמוד שבנינו לאזורים נפרדים בעזרת תגית ה-div. אבל עם ההתפתחות של שפת HTML נוספו לה שדרוגים ועדכונים רבים, בינהם הבולטים והחשובים ביותר הן תגיות הסמנטיקה שנוספו ב-HTML5. תגיות אלה באות להחליף את תגית ה-div של הבלוק הכללי, ולמעשה לתת הגדרה ומשמעות ייחודית לכל אזור בעמוד ולכל קבוצת רכיבים שאנחנו מחליטים להציב בו.",
                "למעשה, מבחינה ויזואלית התגיות הסמנטיות האלה לא משנות דבר, אבל הן כן תורמות רבות ליכולת של הדפדפנים השונים להתמצא בעמודי האינטרנט ולפענח אותם בצורה יותר מהירה וטבוה. הן מאפשרות גם למנועי חיפוש לסרוק את עמודי האינטרנט בצורה יעילה יותר ולהביא לנו תוצאות חיפוש מדויקות יותר. וגם בהיבט של הנגשת האינטרנט למשתמשים בעלי מוגבלויות התגיות האלה משפרות חווית המשתמש.",
                "התרשים הבא ממחיש את הצורה הבסיסית והחלוקה של אזורים שונים בעמוד ואת הבלוקים הסמנטיים שנשתמש בהם."
              ],
              "image": {
                "url": "/images/lessonsContents/module2/lesson6/semantic-tags.png",
                "altText": "Semantic tags structure",
                "descText": "",
                "imageSubject": "המבנה הבסיסי של עמוד אינטרנט עם תגיות סמנטיות.",
                "width": [
                  300,
                  400,
                  500
                ]
              }              
            },
            {
              "textBlock": [
                "כמו שאפשר לראות בתרשים, לכל אזור בעמוד מוקצה אזור שברוב הפעמים יהיה בכל אתר אינטרנט, וכמובן בכל אזור נשתמש בתגית שונה כדי להעביר את משמעות האזור. התגיות שמשמשות כל אזור מפורטות ברשימה הבאה."
              ],
              "listBlock": [
                "<header> - אזור זה מגדיר תוכן שמהווה נושא או תקציר של כל התוכן שנמצא בעמוד, או אפילו בחלק מסוים בעמוד. לדוגמא, לרוב אנחנו נשתמש בבלוק זה כדי למקם את הלוגו של האתר, פרטים אישיים של המשתמש שהתחבר לאתר שלנו באופן אישי (כמו בפייסבוק) וכדומה.",
                "<footer> - בלוק זה יבוא בדרך כלל בתחתית העמוד ויכיל תוכן כמו שמירת זכויות יוצרים, קישורי ניווט מסוימים לחלקים באתר ואלמנטים דומים.",
                "<nav> - בלוק הניווט, קיצור של המילה navigation יכיל סרגל קישורים לעמודים שונים באתר. הבלוק הזה יכול כמובן לעמוד בפני עצמו, אבל הוא גם יכול להכנס תחת בלוק הכותרת (header).",
                "<main> - בלוק התוכן העיקרי, שבו נכניס את כל התוכן העיקרי של העמוד. תג זה יופיע פעם אחת בכל עמוד אינטרנט.",
                "<section> - בלוק יבוא בתוך בלוק התוכן העיקרי, והוא יאגד בתוכו מספר אלמנטים משותפים. למשל אם אנחנו מציגים כתבה באתר אז כל האלמנטים שקשורים לאותה כתבה, קרי הכותרת, כותרת משנה, פסקאות, תגובות יכנסו כולם בתוך בלוק זה. ",
                "<article> - בלוק זה דומה אף הוא במשמעותו ל-section. גם הוא מאגד בתוכו אלמנטים שונים שמהווים יחידה תפקודית אחת. אנחנו יכולים להשתמש בבלוקים section ו-article באופן מודולרי, כך שבלוק section יכיל בתוכו article, או להיפך.",
                "<aside> - בלוק בר צדדי אשר ימוקם בדרך כלל בצד של העמוד ויכיל מידע פחות חשוב באתר. התוכן בחלק זה יכול להוות מידע משלים ונוסף לתוכן העיקרי, אך הוא אינו חיוני לצורך הבנה מיטבית. כמו הערת שוליים במאמר או כתבה."
              ]
            },
            {
              "sectionTitle": "תגים סמנטיים נוספים",
              "textBlock": [
                "התגיות הסמנטיות שמנינו עתה הן תגיות שקשורות לסמנטיקה של מבנה העמוד, אבל הן לא היחידות שכאלה. למעשה, יש עוד הרבה תגיות סמנטיות לצרכים שונים בבניית העמוד, ואת חלקן כבר הספקנו ללמוד בשיעורים הקודמים. לדוגמא תגיות הטקסט השונות. סוגי כותרות, פסקאות, רשימות, טבלאות ועוד תגיות שלמדנו ושעוד נלמד. שפת HTML היא הלכה למעשה שפה שבנויה כולה על תגיות כאלה. בגלל זה קוראים לה HyperText Markup Language."
              ],
              "decorativeLine": "true"
            },
            {
              "sectionTitle": "זמן תרגול - לצקת משמעות לתוכן",
              "textBlock": [
                "בהמשך לתרגיל המתגלגל שעבדת עליו מתחילת יחידת הלימוד הזאת, החלף את כל תגי ה-div שהשתמשת בהם בתגיות בעלות משמעות סמנטית בהתאם למשמעות התוכן שבתוכן."
              ]
            },
            {
              "resources": [
                {
                  "title": "Semantics HTML: What It Is and How to Use It Correctly / Semrush Blog",
                  "url": "https://www.semrush.com/blog/semantic-html5-guide/"
                },
                {
                  "title": "Document and website structure / MDN web docs",
                  "url": "https://developer.mozilla.org/en-US/docs/Learn/HTML/Introduction_to_HTML/Document_and_website_structure"
                },
                {
                  "title": "HTML Semantic Elements / W3Schools",
                  "url": "https://www.w3schools.com/html/html5_semantic_elements.asp"
                }
              ]
            }
          ]
        },
        {
          "lessonId": "2.7",
          "title": "יצירת טפסים (Forms)",
          "sections": [
            {
              "sectionTitle": "טפסים (Forms)",
              "textBlock": [
                "כשאנשים קראו פעם עיתונים, הדבר היחיד שהם יכלו לעשות עם עיתון הוא לקרוא ולהתבונן בתמונות. טוב, לפעמים הם יכלו גם לחייג בטלפון למספר שהם ראו במודעת דרושים או במודעת מכירה של חפץ בעיתון. או אפילו כשסיימו לקרוא את העיתון, אז נהגו לעטוף איתו דגים או לארוז איתו חפצים כשעוברים דירה. אבל היום כשאנחנו קוראים חדשות באינטרנט, או משוטטים ברשת החברתית המועדפת עלינו, אנחנו כגולשים, לוקחים חלק פעיל."
              ],
              "image": {
                "url": "/images/lessonsContents/module2/lesson8/example-form.png",
                "altText": "A boring and depressing bureaucratic form with many sections that need to be filled out such as first name, last name, address, phone, etc. throughout the page. Placed on a wooden table, and next to it a fountain pen.",
                "descText": "",
                "width": [
                  300,
                  400
                ]
              }
            },
            {
              "textBlock": [
                "אנחנו לא רק קוראים כתבה או מתבוננים בתמונה, אלא אנחנו יכולים גם להגיב ממש בזמן אמת לנאמר בכתבה, לסמן \"לייק\" לתמונה, לכתוב פוסט ארוך בפייסבוק שכל החברים שלנו שם יראו, לכתוב בלוג על דברים שאנחנו חזקים בהם ולהגיע לתפוצה רחבה, ועוד, ועוד, ועוד. יש לנו כל כך הרבה הזדמנויות ליצור תוכן בעצמנו באינטרנט.",
                "כל זה נעשה בזכות היכולות של האינטרנט לנהל תקשורת דו-סיטרית בין מוסר המידע (אתר החדשות לדוגמא והכתבים שלו), לבין הצרכן שמקבל את המידע וקורא, בזמן אמת. התכונה המדהימה הזאת קיימת בזכות קבוצת רכיבים מאוד מיוחדת שנקראת - טפסים. אנחנו פוגשים אותם כמעט בכל מקום שאנחנו גולשים בו. כשאנחנו ממלאים איזה סקר, כשאחנו עושים קניות בסופר און-ליין, כשאנחנו כותבים פוסט, או כשאנחנו מגיבים לכתבה חדשותית, ואפילו כשאנחנו מתחברים לחשבון האישי שלנו באתר שאנחנו גולשים בו הרבה. ",
                "אז בואו ניגש לעניין, איך אפשר להוסיף טופס למסמך ה-HTML שלנו? רמז, באופן די דומה למה שלמדנו עד עכשיו על רכיבי תוכן אחרים שהוספנו לעמוד האינטרנט. בעזרת סט של תגיות מיוחדות עבור טפסים.",
                "סט של תגיות? מה הכוונה? כמו שלמדנו על הוספת טבלה שיש לה כמה חלקים שלכל אחד מהם יש תגית משלה והגדרה אישית. כך גם לטפסים. טופס מורכב מכמה חלקים. בואו נראה דוגמא."
              ],
              "image": {
                "url": "/images/lessonsContents/module2/lesson8/form-sample.png",
                "altText": "תבנית דוגמא לטופס",
                "descText": "תבנית דוגמא לטופס פשוט.",
                "width": [
                  300,
                  400
                ]
              }
            },
            {
              "textBlock": [
                "אנחנו יכולים לראות בדוגמא שלמעלה את הרכיבים השונים שמהם מורכב הטופס הפשוט. יש לנו כותרת, יש שדות קלט שבהם המשתמש צריך להכניס את המידע שלו, יש לנו תוויות לכל שדה קלט שמספרות למשתמש איזה מידע בדיוק עליו להכניס לכל שדה קלט, אנחנו יכולים גם לשים לב להבדלים בין שדה קלט אחד לאחר. לכל אחד יש מאפיינים יחודיים, למשל בשדה אחד צריך לכתוב שם, באחר דואר אלקטרוני, ובשלישי תוכן שהוא יותר ארוך ומפורט אולי. בסוף הטופס יש לנו כפתור אישור ושליחה של הטופס. אז איך בונים את תכל'ס?"
              ]
            },
            {
              "sectionTitle": "רכיבי HTML של טפסים",
              "listBlock": [
                "<form> - תגית סמנטית שמהווה את מעטפת לטופס. בתוכה יכנסו כל רכיבי הטופס.",
                "<fieldset> - תגית סמנטית פנימית שמקבצת כמה רכיבי טופס עם איזה שהוא מכנה משותף בינהם. לדוגמא, אם אנחנו בונים סקר דעת קהל בכמה נושאים, אנחנו יכולים לקבץ כל מספר שאלות שקשורות לתת נושא מסוים בקבוצה נפרדת.",
                "<input> - תגית שמסמנת שדה קלט שלתוכה המשתמש יכול להזין מידע מסוים. שדה קלט יכול להיות מסוגים שונים, וכדאי מאוד לקבוע את סוג הקלט של אותו שדה משתי סיבות עיקריות: חוויית המשתמש ויצירת טופס פשוט, קריא ונגיש, וגם מטעמים של אבטחת מידע באינטרנט ומניעה של פירצות אבטחה. אנחנו יכולים לסווג את הקלט באמצעות התכונה type. תכונה נוספת שאנחנו יכולים להוסיף לשדה קלט מתייחס לחיוניות שלו. כלומר אם ברצוננו לקבוע סעיף מסוים בטופס כהכרחי למילוי (שלא יהיה ניתן לשלוח את הטופס בלעדיו), אז אנחנו יכולים לעשות זאת באמצעות הוספת התכונה required, וכך אנחנו מבטיחים שהטופס לא יוכל להישלח בלי אותו סעיף.",
                "<label> - תגית זו מצטרפת ביחד לשדה הקלט על מנת לספר למשתמש מה עליו להזין בשדה הרלוונטי. שני הרכיבים האלה - input ו-label מקושרים בינהם באמצעות תכונה שמוסיפים לכל אחד מהם - id ו-for בהתאמה. "
              ],
              "tableData": {
                "caption": "סיווגים אפשריים של שדה קלט - input types",
                "headingRow": [
                  "type",
                  "הסבר"
                ],
                "rows": [
                  [
                    "text",
                    "קלט מילולי - ערך ברירת המחדל של רכיב input."
                  ],
                  [
                    "number",
                    "קלט מספרי בלבד."
                  ],
                  [
                    "password",
                    "הזנת סיסמא, המידע שהמשמש יזין יופיע בתור כוכביות."
                  ],
                  [
                    "date",
                    "הזנת תאריך לפי פורמט קבוע."
                  ],
                  [
                    "time",
                    "הזנת קלט זמן בפורמט של שעות ודקות."
                  ],
                  [
                    "range",
                    "קלט לפי טווח מסוים."
                  ],
                  [
                    "radio",
                    "בחירה בודדת של פריט בין רשימת פריטים."
                  ],
                  [
                    "checkbox",
                    "בחירה מרובה של פריט בין רשימת פריטים."
                  ],
                  [
                    "color",
                    "בחירת צבע בתוך פלטה של צבעים."
                  ]
                ]
              }
            },
            {
              "listBlock": [
                "<textarea> - שדה קלט שמקבל תוכן עם ריבוי שורות. כברירת מחדל, input מהווה שדה קלט של שורה אחת. כשאנחנו רוצים לתת למשתמש אפשרות לכתוב תוכן ארוך ומפורט יותר, אנחנו יכולים להשתמש ברכיב זה. כמו כן, רכיב זה מקבל תכונות יחודיות המאפשרות לקבוע את גודל השדה, מבחינת שורות (rows) ועמודות (cols).",
                "<button> - תגית זו מאפשרת להוסיף כפתור לטופס שלנו. כפתורים גם הם יכולים להיות עם כמה סיווגים. בראש ובראשונה, טופס צריך את האפשרות לשלוח את המידע שהמשתמש מזין בו, ואת אנחנו יכולים לעשות באמצעות כפתור שתפקידו יהיה אישור ושליחה של תוכן הטופס (submit). במצבים אחרים אנחנו יכולים להשתמש גם בכפתור רגיל (button) כדי לעשות פעולות אחרות שאנחנו רוצים לאפשר למשתמש לעשות."
              ],
              "tableData": {
                "caption": "סיווגים אפשריים של כפתורים - button types",
                "headingRow": [
                  "type",
                  "הסבר"
                ],
                "rows": [
                  [
                    "button",
                    "ערך ברירת המחדל. כפתור רגיל."
                  ],
                  [
                    "submit",
                    "מאתחל את כל תהליך שליחת המידע מהטופס."
                  ],
                  [
                    "reset",
                    "איפוס כל התוכן שמוזן בטופס לערכי ברירת המחדל."
                  ]
                ]
              },
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<form>",
                    "spaces": 2,
                    "color": "red.300"
                  },
                  {
                    "element": "<fieldset>",
                    "spaces": 4,
                    "color": "cyan.300"
                  },
                  {
                    "element": "<legend>Fieldset title</legend>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<ul style='list-style: none; padding: 0'>",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "<li>",
                    "spaces": 8,
                    "color": "white"
                  },
                  {
                    "element": "<label for='fullName'>Full Name: </label>",
                    "spaces": 10,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<input type='text' id='fullName' placeholder='Your full name...' />",
                    "spaces": 10,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</li>",
                    "spaces": 8,
                    "color": "white"
                  },
                  {
                    "element": "<li>",
                    "spaces": 8,
                    "color": "white"
                  },
                  {
                    "element": "<label for='email'>E-Mail: </label>",
                    "spaces": 10,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<input type='text' id='fullName' placeholder='Your E-mail' />",
                    "spaces": 10,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</li>",
                    "spaces": 8,
                    "color": "white"
                  },
                  {
                    "element": "</ul>",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "</fieldset>",
                    "spaces": 4,
                    "color": "cyan.300"
                  },
                  {
                    "element": "<fieldset>",
                    "spaces": 4,
                    "color": "cyan.300"
                  },
                  {
                    "element": "<label for='multilineText'>message: </label>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<textarea id='multilineText' rows='4' cols='35' placeholder='Your message...' />",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</fieldset>",
                    "spaces": 4,
                    "color": "cyan.300"
                  },
                  {
                    "element": "<fieldset>",
                    "spaces": 4,
                    "color": "cyan.300"
                  },
                  {
                    "element": "<button type='submit'>Send</button>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<button type='reset'>Reset</button>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</fieldset>",
                    "spaces": 4,
                    "color": "cyan.300"
                  },
                  {
                    "element": "</form>",
                    "spaces": 2,
                    "color": "red.300"
                  },
                  {
                    "element": "</body>",
                    "spaces": 0,
                    "color": "white"
                  }
                ]
              }
            },
            {
              "frameClause": {
                "frameTitle": "שימו לב!",
                "paragraphs": [
                  "בשלב זה של הקורס אנחנו לומדים כיצד להוסיף טופס לעמוד האינטרנט, אבל אנחנו עדיין לא יודעים כיצד להפוך אותו לאינטראקטיבי. כלומר לשנות את עמוד האינטרנט באמצעות הטופס או לשלוח את המידע בתוכו ליעד אחר. את הדברים האלה נלמד בהמשך הקורס."
                ],
                "borderColor": "red.400"
              },
              "decorativeLine": true
            },
            {
              "sectionTitle": "זמן תרגול",
              "textBlock": [
                "בתרגיל זה נבקש ממך להמשיך את התרגיל המתגלגל שהתחלת בשיעורים הקודמים. השלב הבא בהפיכת הכתבה החדשותית מתוך עיתונות מודפסת לכתבה דיגיטלית יהיה הכנה לקראת האפשרות של הקוראים להגיב לכתבה. כמובן שתוכל לעשות לעזות את זה בעזרת הוספת טופס קצר ופשוט בסוף הכתבה.",
                "המשימה שלך בשלב זה היא להוסיף טופס שיכיל שלושה סעיפי תוכן לפי הפירוט הבא:"
              ],
              "listBlock": [
                "שם מלא (Full Name) - שדה קלט מילולי לשם הזנת שם המגיב. שדה צריך להיות חובה.",
                "דואר אלקטרוני (Email) - שבו המשתמש יזין את כתובת הדואר האלקטרוני האישית שלו (על מנת שהמגיבים לכתבה יהיו מזוהים). גם שדה זה צריך להיות חובה.",
                "כותרת התגובה (Comment Title) - שדה מילולי שהמשתמש יזין את נושא התגובה בשורה אחת. שדה זה צריך להיות חובה.",
                "תגובה (Comment) - שדה הקלט השלישי תהיה התגובה עצמה. כאשר כאן המשתמש יוכל לכתוב תגובה ארוכה עם מספר שורות."
              ]
            },
            {
              "textBlock": [
                "כמו כן, אנא וודא שכל הסעיפים בטופס יהיו נדרשים. כלומר שלא יהיה אפשר לשלוח את התגובה בלי שם, או בלי הזנת דואר אלקטרוני, או כמובן בלי תגובה.",
                "לבסוף הוסף שני כפתורים בסוף הטופס. אחד עבור אישור ושליחה, וכפתור נוסף עבור איפוס תוכן הטופס."
              ],
              "resources": [
                {
                  "title": "Your first form / Article by MDN web docs",
                  "url": "https://developer.mozilla.org/en-US/docs/Learn/Forms/Your_first_form"
                },
                {
                  "title": "The Button element / Article by MDN web docs",
                  "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Element/button"
                },
                {
                  "title": "The Input element / Article by MDN web docs",
                  "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input"
                }
              ]
            }
          ]
        },
        {
          "lessonId": "2.8",
          "title": "מידע על העמוד ו-Meta Data",
          "sections": [
            {
              "sectionTitle": "מה בראש?",
              "textBlock": [
                "אחרי שלמדנו על כל הרכיבים והעצמים של גוף העמוד (body), וראינו איזה איברים נפלאים הוא יכול להכיל, הגיע הזמן לדבר קצת על הראש. אחרי הכל בלי הראש, כל הגוף לא יכול לתפקד. אז מה יש לנו בראש העמוד?",
                "בראש מסמך ה-HTML, כלומר בין תגיות ה-head אנחנו נמצא אם המידע שלא מוצג למשתמש שלנו. ונכלל בו כל המידע אודות האתר, פרטים טכניים, שם האתר, קישורים לקבצים שנדרשים כדי להריץ את האתר כהלכה, שפת הפיתוח של האתר ושפת התוכן שבו, שפת קידוד האתר, מילות מפתח למנועי חיפוש, ועוד תכנים שמוסרים מידע על האתר.",
                "המידע הזה אמנם נסתר מעיני המשתמש, אבל הוא חשוב מאוד שכן מי שכן עושה בו שימוש הם הדפדפנים שמקבלים מידע רלוונטי כיצד לקודד את האתר ולהציגו בדיוק כפי שאנחנו תכננו, מנועי החיפוש סורקים את האתרים, קודם כל לפי מילות המפתח שהם מוצאים, וככה הם יודעים לתת לנו תוצאות מדויקות של מה שאנחנו מחפשים. וגם אם אנחנו משתמשים בקבצים שונים באתר שהכרחיים לניראות ולתפקוד שלו, אז אנחנו נקשר אותם בדיוק במקום הזה - בראש.",
                "יש לנו כמה תגיות שכדאי לנו להכיר בתוך ה-head. אך ראשית, בואו ניזכר במה שלמדנו בשיעור הראשון של היחידה הזאת על המבנה האנטומי של מסמך HTML, ואז נעבור על כל התגיות הבסיסיות בנפרד."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<!DOCTYPE html>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<html>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<head>",
                    "spaces": 2,
                    "color": "blue.300"
                  },
                  {
                    "element": "<meta charset=\"UTF-8\" />",
                    "spaces": 4,
                    "color": "pink.200"
                  },
                  {
                    "element": "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />",
                    "spaces": 4,
                    "color": "pink.200"
                  },
                  {
                    "element": "<meat name='description' content='This is website of learning web development course.' />",
                    "spaces": 4,
                    "color": "pink.200"
                  },
                  {
                    "element": "<meat name='keywords' content='web development, Learning HTML, Learning CSS, Learning JS' />",
                    "spaces": 4,
                    "color": "pink.200"
                  },
                  {
                    "element": "<title>Document</title>",
                    "spaces": 4,
                    "color": "green.300"
                  },
                  {
                    "element": "<link rel='icon' href='favicon.ico' type='image/x-icon' />",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<link rel='stylesheet' href='styling-file.css' />",
                    "spaces": 4,
                    "color": "cyan.300"
                  },
                  {
                    "element": "<style></style>",
                    "spaces": 4,
                    "color": "cyan.300"
                  },
                  {
                    "element": "<script src='script-file.js' defer></script>",
                    "spaces": 4,
                    "color": "orange.300"
                  },
                  {
                    "element": "</head>",
                    "spaces": 2,
                    "color": "blue.300"
                  },
                  {
                    "element": "<body>",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "<script src='script-file.js'></script>",
                    "spaces": 4,
                    "color": "orange.300"
                  },
                  {
                    "element": "</body>",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "</html>",
                    "spaces": 0,
                    "color": "white"
                  }
                ]
              }
            },
            {
              "sectionTitle": "title - כותרת העמוד",
              "textBlock": [
                "צמד תגיות אלה, תגית פותחת ותגית סוגרת, מציינות את כותרת העמוד. אבל שימו לב להבדל כותרת זו לבין הכותרת בגוף העמוד שלמדנו בשיעורים הקודמים (h1), הכותרת title שמופיעה בראש מוסרת מידע על נושא האתר ולא מוצגת בתוך גוף העמוד. למעשה, אנחנו כן יכולים לראות את התוכן שנמצא בין תגיות אלה בכותרת החלון של האתר, אך זה המקום היחיד שאפשר לראות כותרת זו."
              ]
            },
            {
              "sectionTitle": "meta - פרטים על העמוד (metadata)",
              "textBlock": [
                "metadata (מטא-דאטה) זה למעשה נתונים שמתארים נתונים. בתגית meta אנחנו יכולים למצוא את כל הנתונים על הנתונים של האתר. ובשיעור הזה אנחנו נראה חלק מהנתונים שכתובים שם ואת הבסיסיים שבהם."
              ],
              "listBlock": [
                "שפת הקידוד - charset='utf-8' - המחרוזת הזאת utf-8 מוסרת מידע שהאתר שאנחנו בונים מכיל תווים אוניברסליים, אותיות ומספרים, מכל השפות האנושיות הקיימות בעולם. משמעות הדבר היא שכאשר אנחנו משתמשים בשיטת קידוד זו אנחנו יכולים ליצור אתר באיזו שפה אנושית שאנחנו רק רוצים. אם מעניין אתכם ללמוד על utf-8 ועל שיטות קידוד נוספות, אתם יותר ממוזמנים להציץ ברשימת המקורות להרחבת הידע שמופיעה בסוף השיעור הזה.",
                "תג ה-meta השני שאנחנו מוצאים בדוגמא שלמעלה מוסר לנו מידע על גודל חלון התצוגה והיחס רוחב-גובה האופטימלי לתצוגה של האתר. בנושא זה אנחנו נרחיב את הלמידה ביחידת הלימוד הבאה כשנלמד על השימוש ב-CSS ועל תצוגת האתר והתאמת האתר למסכים בגדלים שונים.",
                "שתי תגיות ה-meta הבאות הן תגיות שמנועי החיפוש (Google, Bing ועוד) עושים בהן שימוש משמעותי, ולמעשה מבינים במה האתר שלנו עוסק, ויכולים להציג תוצאות רלוונטיות לכל משתמש שמחפש תכנים דומים. בתגים אלה אנחנו צריכים לתת מידע קצר ותמציתי ככל הניתן על האתר שלנו, אך גם להיות מאוד מדוייקים. בתוכן של תג ה-description נכתוב משפט קצר ותמציתי על האתר שלנו. בעוד שבתג ה-keywords אנחנו נוסיף מספר מילות מפתח מופרדות בפסיקים עבור מנועי החיפוש."
              ]
            },
            {
              "sectionTitle": "Style - וקישורים לקבצים נוספים",
              "textBlock": [
                "אנחנו יכולים להוסיף עיצוב לאתר ישירות בתוך מסמך ה-HTML בין תגיות ה-style, ואנחנו יכולים גם לכתוב קובץ עיצוב נפרד ולקשר אותו למסמך ה-HTML באמצעות תגית ה-link. בעניין הזה אנחנו נרחיב כמובן יותר ביחידת הלימוד הבאה של הקורס, אבל בינתיים אפשר כבר להכיר את האפשרויות האלו.",
                "בהזדמנות זו חשוב לציין ולהבין שאתר אינטרנט לא מורכב ממסמך HTML בודד, אלא למעשה זה אתר אינטרנט אחד הוא אוסף של הרבה קבצים מסוגים שונים, בינהם דפי HTML, קבצי עיצוב וסגנון, קבצי פונקציות ותפקודיות, תמונות, סרטונים, אייקונים ועוד, ועוד ועוד. כמובן שבין כל הקבצים האלה צריכה להיות קישוריות, וחלק מהקישוריות הזאת באה לידי ביטוי כאן בין תגי ה-head, באמצעות תגית ה-link."
              ]
            },
            {
              "sectionTitle": "Script",
              "textBlock": [
                "כמו כן, בין הקבצים המקושרים אנחנו יכולים גם לקשר קובץ של סקריפטים (Scripts). גם אותם כמו עיצוב אנחנו יכולים ליצור בתוך מסמך ה-HTML, אך דבר זה אינו מומלץ, ועדיף ליצור את קובץ נפרד ולקשר אותו לדף ה-HTML.",
                "כמו כן, כשאנחנו מחברים קובץ script חשוב שהקובץ ייטען אחרי שכל רכיבי ה-HTML נטענו, ומומלץ גם אחרי שקבצי העיצוב נטענו. זאת על מנת להמנע משגיאות אפשריות שעלולות להתרחש במקרה שפונקציה אמורה לפעול על רכיב מסוים שעדיין לא נטען בעמוד. מהסיבה הזאת הוספנו את מילת המפתח defer בקישור של קובץ ה-script, ובדרך זו הדפדפן יודע שהוא צריך לטעון את הקובץ הזה אחרון. אפשרות נוספת היא לקשר את קובץ ה-script בסוף מסמך ה-HTML, בתחתית ה-body."
              ]
            },
            {
              "resources": [
                {
                  "title": "What's in the head? Metadata in HTML / Article by MDN web docs",
                  "url": "https://developer.mozilla.org/en-US/docs/Learn/HTML/Introduction_to_HTML/The_head_metadata_in_HTML"
                },
                {
                  "title": "HTML Meta tag / Article by W3Schools",
                  "url": "https://www.w3schools.com/tags/tag_meta.asp"
                },
                {
                  "title": "UTF-8 / Article by Wikipedia",
                  "url": "https://en.wikipedia.org/wiki/UTF-8"
                },
                {
                  "title": "UTF-8 code page / Table of all characters and their unicode",
                  "url": "https://www.charset.org/utf-8/2"
                }
              ]
            }
          ]
        },
        {
          "lessonId": "2.9",
          "title": "מחלקות וזהויות (Classes & Identifires)",
          "sections": [
            {
              "sectionTitle": "מחלקות של עצמים וייחודיות",
              "textBlock": [
                "בשעה טובה אנחנו כמעט מגיעים לקו הסיום של פרק ה-HTML של הקורס. אבן הפינה של בניית אתר אינטרנט שלם. בשיעור הזה אנחנו נדבר על מחלקות וזהויות של עצמים במסמך ה-HTML ובעמוד האינטרנט. תוכן השיעור הזה, למעשה, מהווה גם סיכום לכל יחידת הלימוד, וגם הכנה לקראת העבודה שלנו ביחידת הלימוד הבאה, שבה נעסוק בכל מה שקשור לעיצוב אתר אינטרנט ולניראות התצוגה שלו."
              ],
              "image": {
                "url": "/images/stylingImages/Gems are arranged according to colors on the shelves of an ancient wooden library, in a realistic style from the 1940s..jpg",
                "altText": "sorting-gemstones-into-four-ancient-bricks",
                "width": [
                  300,
                  400
                ]
              }
            },
            {
              "textBlock": [
                "עד כה למדנו על רכיבים ועצמים שונים שאפשר להציג על גבי דפדפן האינטרנט. ראינו איך מוסיפים עצמים (Elements) מילוליים מסוגים שונים, איך מוסיפים קישורים, תמונות, טבלאות וטפסים. כל רכיב כזה שרצינו להוסיף פשוט הוספנו את הקוד המתאים למסמך ה-HTML שלנו, ומיד ראינו אותו מתווסף לעמוד הדפדפן מתחת לרכיב הקודם.",
                "אז יופי, יש לנו עמוד אינטרנט עם כל מיני רכיבים בתוכו, אבל עדיין חסרים לנו כמה מאפיינים חשובים ותכונות הכרחיות, כדי שגולשים באמת ירצו להיכנס לאתר שלנו, ולהשתמש בו. למשל כדי להציג תגובה שהמשתמש כותב לכתבה שהוא קורא, אנחנו צריכים לקבל את תוכן התגובה מתוך הטופס אותו הוא ממלא, ולהוסיף את התוכן החדש לעמוד, כלומר למסמך ה-HTML. אז איך עושים את זה? בדיוק בשביל זה יש לנו את היכולות של שפת התכנות Java Script שנלמד עליה ביחידת הלימוד הרביעית בקורס הזה. ולא רק היכולות הפונקציונאליות חשובות כאן, אלא גם הניראות (Visualization) ? איך אנחנו יכולים לעזור לקוראים באתר שלנו להתמצא בצורה קלה באתר, לקרוא את הכתבות בצורה נוחה ונעימה לעין, בלי להתאמץ יותר מדי? ובמקרים אחרים, גם לעזור למשתמשים בעלי מוגבלויות? את כל זה ועוד נפתור ביחידת הלימוד הבאה בפרק העיצוב בעזרת CSS. ",
                "אבל לפני שניגש ללמוד את הנושאים הבאים, נלמד קודם כל על מה שמחבר ומקשר בין שלושת עמודי התווך (HTML, CSS, Java Script) שעליהם כל האתר שלנו יעמוד, בעצם הדבק שמחבר בין שלושתם וגורם להם לפעול כגוף אחד שלם. והדברים האלה הם classes (מחלקות) ו-Identifires (IDs, זהויות)."
              ]
            },
            {
              "sectionTitle": "Class",
              "textBlock": [
                "למעשה, בדיוק כמו שבספריה הספרים מחולקים לקטגוריות שונות כמו גיל יעד של הספרים, הסוגה (ז'אנר) שלהם ולפי הא\"ב של המחבר, כך גם לנו חלוקה של העצמים השונים שיש לנו בעמוד יכולה לעזור לנו לתפעל את האתר. למשל קבוע שכל הכתבות באתר יוצגו בצורה אחידה, לעומת התגובות שתוצגנה בצורה אחרת, לדוגמא בכתב מעט יותר קטן ונטוי. או שהתמונות יוצגו בגודל אחיד וכדומה.",
                "בשביל לעשות את זה אנחנו צריכים להוסיף תכונה (Attribute) נוספת לכל עצם ורכיב שאנחנו משתמשים בו. התכונה הזאת היא class, אנחנו נוסיף אותה בתוך התגית הפותחת של הרכיב, ונשייך את אותו רכיב למחלקה בשם משמעותי שאנחנו נחליט עליו. כמו בדוגמא שלהלן."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<p class='textArticle'>תוכן הכתבה</p>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<p class='textComment'>תגובה לכתבה</p>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</body>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "p",
                    "style": {
                      "class": "textArticle",
                      "direction": "rtl"
                    },
                    "content": "תוכן הכתבה"
                  },
                  {
                    "type": "p",
                    "style": {
                      "class": "textComment",
                      "direction": "rtl"
                    },
                    "content": "תגובה לכתבה"
                  }
                ]
              }
            },
            {
              "textBlock": [
                "בדוגמא שלמעלה אנחנו יכולים לראות שהוספנו שתי פסקאות, אך חילקנו אותן לשתי מחלקות שונות, בדרך זו אנחנו יכולים להתייחס לכל אחת מהן בנפרד, ולתת לכל אחת מהן תכונות עיצוביות שונות והתנהגות שונה בעמוד."
              ]
            },
            {
              "sectionTitle": "Identify, ID (זהות)",
              "textBlock": [
                "זהות (ID), לעומת זאת מתייחסת לעצם בודד בתוך מחלקה, או אפילו ייחודי בתוך העמוד כולו. כלומר אם אנחנו נרצה לתת אפיון שונה לפסקה אחת מתוך כל הפסקאות של כתבה מסוימת, או שנרצה לפנות לקישור, תמונה או סעיף מסוים בטופס ולאפיין בצורה שונה משאר המחלקה שהרכיב משוייך אליה, אז במקרה כזה אנחנו נשתמש בזהות הייחודית שלו. כדי לקבוע את הזהות של רכיב פשוט נוסיף בתג הפותח את התכונה id."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<p class='textArticle' id='firstParagraph'>פסקה ראשונה</p>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<p class='textArticle' id='secondParagraph'>פסקה שניה</p>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<p class='textArticle' id='thirdParagraph'>פסקה שלישית</p>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<p class='textComment' id='firstComment'>תגובה ראשונה</p>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<p class='textComment' id='secondComment'>תגובה שניה</p>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<p class='textComment' id='thirdComment'>תגובה שלישית</p>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</body>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "p",
                    "style": {
                      "class": "textArticle",
                      "direction": "rtl"
                    },
                    "content": "פסקה ראשונה"
                  },
                  {
                    "type": "p",
                    "style": {
                      "class": "textArticle",
                      "direction": "rtl"
                    },
                    "content": "פסקה שניה"
                  },
                  {
                    "type": "p",
                    "style": {
                      "class": "textArticle",
                      "direction": "rtl"
                    },
                    "content": "פסקה שלישית"
                  },
                  {
                    "type": "p",
                    "style": {
                      "class": "textComment",
                      "direction": "rtl"
                    },
                    "content": "תגובה ראשונה"
                  },
                  {
                    "type": "p",
                    "style": {
                      "class": "textComment",
                      "direction": "rtl"
                    },
                    "content": "תגובה שניה"
                  },
                  {
                    "type": "p",
                    "style": {
                      "class": "textComment",
                      "direction": "rtl"
                    },
                    "content": "תגובה שלישית"
                  }
                ]
              }
            },
            {
              "textBlock": [
                "כמו שאנחנו יכולים לראות, בשלב זה עצם זה שהוספנו לכל הרכיבים מחלקות וזהויות לא שינה דבר בפלט. אך ביחידה הבאה אנחנו נכיר את התועלת של תכונות אלה וכיצד אפשר להשתמש במחלקות השונות ובזהויות הייחודיות כדי לעצב את עמוד האינטרנט שלנו בצורה שתהיה נוחה ונעימה לקריאה לכל."
              ],
              "decorativeLine": "true"
            },
            {
              "sectionTitle": "זמן תרגול",
              "textBlock": [
                "בהמשך לתרגיל המתגלגל מתחילת הקורס, הוסיפו לכל רכיב במסמך ה-HTML שלכם מחלקה (class) ייעודית בעלת שם משמעותי שמתאר בצורה תמציתית את קבוצת הרכיבים אליה אותו רכיב משתייך."
              ],
              "resources": [
                {
                  "title": "class / Article by MDN web docs",
                  "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/class"
                },
                {
                  "title": "id / Article by MDN web docs",
                  "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/id"
                },
                {
                  "title": "HTML class attribute / Article by W3School",
                  "url": "https://www.w3schools.com/html/html_classes.asp"
                },
                {
                  "title": "HTML id attribute / Article by W3School",
                  "url": "https://www.w3schools.com/html/html_id.asp"
                },
                {
                  "title": "HTML Class Attribute / Article by Geeks for Geeks",
                  "url": "https://www.geeksforgeeks.org/html-class-attribute/"
                },
                {
                  "title": "HTML Id Attribute / Article by Geeks for Geeks",
                  "url": "https://www.geeksforgeeks.org/html-id-attribute/?ref=lbp"
                }
              ]
            }
          ]
        },
        {
          "lessonId": "2.10",
          "title": "בחן את עצמך",
          "sections": [
            {
              "sectionTitle": "בחן את עצמך",
              "testYourself": [
                {
                  "question": "לפי המבנה האנטומי הבסיסי של מסמך HTML, באיזה חלק נכתוב את שורת הקוד הבאה?",
                  "codeBox": {
                    "codeLang": "HTML",
                    "lines": [
                      {
                        "element": "<title>Website subject</title>",
                        "color": "white",
                        "spaces": 0
                      }
                    ]
                  },
                  "options": [
                    "בין תגי הפתיחה והסגירה של הראש <head></head>",
                    "בין תגי הפתיחה והסגירה של הגוף <body></body>",
                    "בתוך התג הפותח <head>",
                    "בתוך התג הפותח <body>"
                  ],
                  "correctAnswer": "בין תגי הפתיחה והסגירה של הראש <head></head>",
                  "explainAnswer": "את תגית ה-title אנחנו רושמים בין תגי הפתיחה והסגירה של ה-head. זו היא תגית שמתארת את כותרת או נושא העמוד ואינה מוצגת כחלק מתוכן הדפדפן."
                },
                {
                  "question": "לאיזה סוגי כותרות מתאימה הכותרת הראשית <h1> וכיצד נשתמש בה באתר?",
                  "options": [
                    "נשתמש בה פעם אחת בלבד בכל עמוד שאנחנו בונים באתר, כדי לא לבלבל את מנועי החיפוש.",
                    "נשתמש בכותרת זו בכותרות של כתבות, על מנת להמחיש לקורא את ההבדל בין הכותרת לגוף הכתבה.",
                    "זה לא משנה באיזה סוג כותרת נשתמש, אנחנו יכולים להשתמש בכל סוג כותרת בהתאם לצרכי האתר."
                  ],
                  "correctAnswer": "נשתמש בה פעם אחת בלבד בכל עמוד שאנחנו בונים באתר, כדי לא לבלבל את מנועי החיפוש.",
                  "explainAnswer": "לסוגי הכותרות יש משמעות סמנטית. הדפדפנים, מנועי החיפוש וכן קוראי מסכים מזהים את חשיבות הכותרות לפי המספור שלהן, לכן ההמלצה היא להשתמש בכותרת h1 פעם אחת בלבד בכל עמוד."
                },
                {
                  "question": "היכן אנחנו יכולים למצוא ולהשתמש בקוד HTML יחסי הורים-ילדים?",
                  "options": [
                    "כל התשובות נכונות.",
                    "ברשימות מסוג סדר <ol>.",
                    "כאשר אנחנו הופכים מילה אחת בתוך פסקה לקישור.",
                    "ביצירת טבלה עם 4 עמודות ועשרים שורות."
                  ],
                  "correctAnswer": "כל התשובות נכונות.",
                  "explainAnswer": "יחסי הורה-ילד מתארים את ההיררכיה שבין רכיבים במסמך HTML, רכיב אחד שיכול להכיל בתוכו רכיבים נוספים. לכן אנחנו יכולים למצוא את התכונה הזאת בכל קטע של קוד."
                },
                {
                  "question": "הוספתי קישור לאתר שלי כמו שמופיע בקטע הקוד הנתון. אבל כשהרצתי את האתר ולחצתי את הקישור גיליתי להפתעתי שהקישור לא עובד, כלומר לא שולח אותי לויקיפדיה.מה חסר בקטע הקוד?",
                  "options": [
                    "חסר הנתיב url שאליו הקישור אמור לנווט. צריך להוסיף את התכונה href עם כתובת אתר היעד.",
                    "חסר הנתיב url שאליו הקישור אמור לנווט. צריך להוסיף את התכונה src עם כתובת אתר היעד.",
                    "חסר נתיב כתובת היעד של האתר אליו אני רוצה לקשר, באמצעות התכונה target.",
                    "אף תשובה אינה נכונה."
                  ],
                  "correctAnswer": "חסר הנתיב url שאליו הקישור אמור לנווט. צריך להוסיף את התכונה href עם כתובת אתר היעד.",
                  "explainAnswer": "תגית קישור <a> היא תגית שלא יכולה לבוא בפני עצמה, והיא חייבת לקבל לפחות תכונה אחת של נתיב היעד. לכן ביצירת קישור בעמוד אנחנו נוסיף את התכונה href, קיצור של hyperlink reference.",
                  "codeBox": {
                    "codeLang": "HTML",
                    "lines": [
                      {
                        "element": "<a>Link to Wikipedia</a>",
                        "color": "white",
                        "spaces": 0
                      }
                    ]
                  }
                },
                {
                  "question": "כשמוסיפים תמונה למסמך HTML, איזה תכונות חשוב להוסיף לתגית img?",
                  "options": [
                    "src בשביל לציין את נתיב המקור של התמונה, ו-alt בשביל להוסיף טקסט אלטרנטיבי.",
                    "href בשביל לציין את הקישור לתמונה בתיקיית הפרויקט ו-alt בשביל להוסיף טקסט אלטרנטיבי.",
                    "src בלבד בשביל לציין את הנתיב של התמונה בתיקיית הפרויקט או באינטרנט.",
                    "href בלבד בשביל לציין את הקישור למקור התמונה בתיקיית הפרויקט או באינטרנט."
                  ],
                  "correctAnswer": "src בשביל לציין את נתיב המקור של התמונה, ו-alt בשביל להוסיף טקסט אלטרנטיבי.",
                  "explainAnswer": "כאשר אנחנו רוצים להוסיף תמונה יש שני שתי תכונות הכרחיות שאנחנו צריכים להוסיף. הראשונה היא src שמציינת את הנתיב למקור התמונה, בין אם היא נמצאת בתוך הפרויקט שלנו, או באינטרנט, והתכונה השניה היא alt שמציינת את הטקסט החלופי לכל מקרה של בעיה בטעינת התמונה באתר. כמו כן, מומלץ גם להוסיף מימדי רוחב וגובה לתמונה על מנת שהיא לא תוצג בגודל המקורי."
                },
                {
                  "question": "ניתוב מלא מתייחס לדרך המלאה מהתיקייה הראשית ועד לאובייקט שאנחנו רוצים להתייחס אליו, ואילו ניתוב יחסי מתייחס לדרך מהתיקייה הנוכחית אל האובייקט הרצוי.",
                  "options": [
                    "נכון",
                    "לא נכון"
                  ],
                  "correctAnswer": "נכון",
                  "explainAnswer": ""
                },
                {
                  "question": "מתי נשתמש בניתוב מלא ובניתוב יחסי?",
                  "options": [
                    "בניתוב מלא נשתמש כשאנחנו רוצים לנווט לעמוד אינטרנט מחוץ לאתר שלנו, ובניתוב יחסי נשתמש כשנרצה לנווט לעמוד בתוך האתר.",
                    "בניתוב מלא נשתמש כשאנחנו רוצים לנווט לעמוד בתור האתר שלנו, ואילו בניתוב יחסי נשתמש כשנרצה לנווט לעמוד אינטרנט מחוץ לאתר .",
                    "תמיד נעדיף להשתמש בניתוב מלא, כי זה יותר בטוח ומונע הרבה טעויות.",
                    "תמיד נעדיף להשתמש בניתוב יחסי, כי זה חוסך הרבה זמן ומשאבים."
                  ],
                  "correctAnswer": "בניתוב מלא נשתמש כשאנחנו רוצים לנווט לעמוד אינטרנט מחוץ לאתר שלנו, ובניתוב יחסי נשתמש כשנרצה לנווט לעמוד בתוך האתר.",
                  "explainAnswer": "בניתוב יחסי נעדיף להשתמש בתוך הפרויקט שלנו, כי בו אנחנו יכולים לשלוט בצורה מלאה על ההיררכיה ומבנה התיקיות. אך כאשר אנחנו רוצים להוסיף קישור חיצוני, אין לנו ברירה אלא לציין את כתובת העמוד המלאה כדי להגיע ליעד הרצוי."
                },
                {
                  "question": "איזה הבדל חזותי (Visual) נראה באתר שלנו אם נחליף את תגיות ה-div שאנחנו משתמשים בהן לתגיות סמנטיות כמו, header, section, article, main ו-footer?",
                  "options": [
                    "לא נראה שום הבדל חזותי.",
                    "האתר יראה מעוצב יפה יותר ומחולק לאזורים נפרדים.",
                    "הגודל של הטקסטים ישתנו בהתאם לאופי של כל תגית סמנטית.",
                    "האתר יטען בצורה יותר מהירה בדפדפן.",
                    "כל התשובות נכונות, למעט התשובה שטוענת שלא נראה שום הבדל חזותי."
                  ],
                  "correctAnswer": "לא נראה שום הבדל חזותי.",
                  "explainAnswer": "התגיות הסמנטיות לא משפיעות על החזות של האתר, אלא משמעותן מתבטאת בפענוח של קוד האתר על-ידי הדפדפן. כמו כן, מנועי חיפוש וקוראי מסכים נעזרים בהן כדי לסרוק את האתר בצורה יעילה ומהירה."
                },
                {
                  "question": "בתוך תגי הראש (head) יש לנו כמה תגיות אפשריות שאנחנו יכולים להשתמש בהן כדי להוסיף עיצוב, כמו בדוגמא שלהלן. מה ההבדל בין התגיות האלה?",
                  "codeBox": {
                    "codeLang": "HTML",
                    "lines": [
                      {
                        "element": "<head>",
                        "color": "white",
                        "spaces": 0
                      },
                      {
                        "element": "<link rel='stylesheet' href='styling-file.css' />",
                        "color": "white",
                        "spaces": 2
                      },
                      {
                        "element": "<style></style>",
                        "color": "white",
                        "spaces": 2
                      },
                      {
                        "element": "</head>",
                        "color": "white",
                        "spaces": 0
                      }
                    ]
                  },
                  "options": [
                    "התגית שבשורה 2 מיועדת כדי לחבר קובץ עיצוב נפרד למסמך ה-HTML, ואילו בין התגיות שבשורה 3 אפשר להוסיף תכונות עיצוביות בתוך המסמך עצמו.",
                    "אין שום הבדל בין התגיות הנתונות למעלה.",
                    "שתי השורות האלה קשורות לעיצוב של העמוד, שזה דבר חזותי, לכן בקטע הקוד הנ\"ל יש טעות והן צריכות להיות בתוך ה-body."
                  ],
                  "correctAnswer": "התגית שבשורה 2 מיועדת כדי לחבר קובץ עיצוב נפרד למסמך ה-HTML, ואילו בין התגיות שבשורה 3 אפשר להוסיף תכונות עיצוביות בתוך המסמך עצמו.",
                  "explainAnswer": ""
                },
                {
                  "question": "מה פירוש הביטוי UTF-8 שמצויין בתגי ה-metadata?",
                  "options": [
                    "פירוש הדבר הוא שפת קידוד שמתרגמת את שפת המכונה לשפה אנושית, ושבאתר זה ניתן להשתמש בכל שפה אנושית קיימת.",
                    "אין לביטוי הזה משמעות מיוחדת בפיתוח האתר.",
                    "פירוש הדבר ששפת הקידוד של האתר מתרגמת את הקוד משפת מכונה לשפה האנגלית בלבד. לא ניתן לכתוב באתר תוכן בשפות אחרות.",
                    "פירוש הדבר שבאתר זה שפת הקידוד מאפשרת לכתוב תוכן באתר בעד שמונה שפות אנושיות שונות."
                  ],
                  "correctAnswer": "פירוש הדבר הוא שפת קידוד שמתרגמת את שפת המכונה לשפה אנושית, ושבאתר זה ניתן להשתמש בכל שפה אנושית קיימת.",
                  "explainAnswer": ""
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "module": 3,
      "title": "CSS",
      "lessons": [
        {
          "lessonId": "3.1",
          "title": "תחביר וצעדים ראשונים עם CSS?",
          "sections": [
            {
              "sectionTitle": "מה זה CSS?",
              "textBlock": [
                "בפרק הקודם למדנו את הרכיבים הבסיסיים של שפת HTML. אם נדמה זאת לגוף האדם, אז עכשיו אנחנו יודעים לבנות את העצמות והשלד של הגוף. ביחידת לימוד זו נלמד להוסיף על השלד את העור. כמו שהעור בגוף האדם מבטא את הצד החזותי שלנו, כך גם באמצעות שפת CSS אנחנו מבטאים את הצד החזותי של האתר."
              ],
              "image": {
                "url": "/images/stylingImages/cover-css.png",
                "altText": "Seven Magic Mountains, South Las Vegas Boulevard, Las Vegas, NV, USA.",
                "width": [
                  300,
                  500
                ],
                "descText": "Seven Magic Mountains, South Las Vegas Boulevard, Las Vegas, NV, USA. Photo by AJ Elgammal on Unsplash"
              }
            },
            {
              "textBlock": [
                "CSS (Cascading Style Sheets, דפי סגנון מדורגים) זו שפה שמשתמשים בה כדי לעצב ולסגנן דפי אינטרנט שנכתבים באמצעות שפת HTML. שפת CSS מתארת למעשה את אופן הצגתם של רכיבי ה-HTML בתוך העמוד ואת הסידור שלהם ביחד לעמוד כולו, וביחס לרכיבי אחרים שנמצאים בו. בשונה משפת HTML, שפת CSS היא לא שפת markup, כלומר היא לא בנויה על תגיות כמו שלמדנו בפרק הקודם, אלא היא שפה שמתבססת על בחירת רכיב HTML מסוים ועיצובו."
              ]
            },
            {
              "sectionTitle": "יישום CSS בתוך מסמך HTML",
              "textBlock": [
                "אנחנו יכולים להחיל עיצוב על מסמך HTML בשלוש דרכים שונות. דרך אחת והפחות מומלצת וטובה היא באמצעות שילוב הוראות ה-CSS בתוך תגיות ה-HTML באמצעות התכונה style. במילים אחרות, דרך זאת נקראת inline style, אך כאמור דרך זו פחות טובה מכיוון שגם ככה מסמך HTML יכול להיות עמוס במידע, ואנחנו מעדיפים שלא לערבב בו גם תכונות עיצוביות. אך לשם ההמחשה, הוספת עיצוב בשיטה זו תראה כך:"
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<h1 style='...css rule...'>Main Heading</h1>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</body>",
                    "spaces": 0,
                    "color": "white"
                  }
                ]
              }
            },
            {
              "textBlock": [
                "הדרך השניה להחיל עיצוב על מסמך HTML בודד היא באמצעות הוספת חוקי העיצוב בין תגיות הראש (head) באמצעות צמד תגיות style ייעודיות. שיטה זו טובה אם האתר שלנו מכיל עמוד אינטרנט אחד, שאנחנו רוצים להחיל רק עליו את העיצוב. אך אם האתר שלנו מכיל כמה עמודים אזי אנחנו נצטרך להעתיק את העיצוב שבין התגיות לכל העמודים באתר כדי שהם יקבלו את אותו עיצוב אחיד."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<head>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<style>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "...",
                    "spaces": 4,
                    "color": "gray.500"
                  },
                  {
                    "element": "css rules",
                    "spaces": 4,
                    "color": "gray.500"
                  },
                  {
                    "element": "...",
                    "spaces": 4,
                    "color": "gray.500"
                  },
                  {
                    "element": "</style>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</head>",
                    "spaces": 0,
                    "color": "white"
                  }
                ]
              }
            },
            {
              "textBlock": [
                "הדרך השלישית, והעדיפה מכולן, להחיל עיצוב על מסמך HTML היא בשיטת עבודה עם מסמכים מרובים. לפי שיטה זו אנחנו נפצל את העבודה שלנו לשני סוגים של קבצים. קבצי HTML שאחראים על הרכיבים והתוכן שיש לנו באתר, וקבצי CSS שאחראים על העיצוב והניראות של האתר. את הקישוריות בין הקבצים נעשה באמצעות תגית ה-link שנוסיף בין תגי הראש (head) בתוך מסמך ה-HTML.",
                "בשיטה זו אנחנו נוכל להחיל עיצוב אחיד על כל העמודים שנוסיף לאתר שלנו בצורה פשוטה. יתר על כן, שיטה זו תסייע לנו רבות לבצע שינויים חזותיים באתר באופן יותר יעיל ונכון. שכן אם אנחנו רוצים לשנות את הצבע של הכותרות המשניות בכל האתר, אם נעבוד בשיטה השניה נצטרך לעבור עמוד אחר עמוד ולעדכן את הצבע החדש. לעומת זאת, בשיטה של פיצול הקבצים, מספיק שנעדכן את הקובץ הנפרד והעמודים בכל האתר יתעדכנו מיד. "
              ],
              "codeBox": {
                "codeLang": "Files structure",
                "lines": [
                  {
                    "element": "/root",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "index.html",
                    "color": "white",
                    "spaces": 3
                  },
                  {
                    "element": "style.css",
                    "color": "white",
                    "spaces": 3
                  }
                ]
              }
            },
            {
              "codeBox": {
                "codeLang": "index.html",
                "lines": [
                  {
                    "element": "<html>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<head>",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "<link rel='stylesheet' href='style.css' />",
                    "spaces": 4,
                    "color": "cyan.300"
                  },
                  {
                    "element": "</head>",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "<body>",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": " ... ",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "</body>",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "</html>",
                    "spaces": 0,
                    "color": "white"
                  }
                ]
              }
            },
            {
              "sectionTitle": "תחביר שפת CSS",
              "textBlock": [
                "כמו שראינו בדוגמא האחרונה צורת הכתיבה של שפת CSS היא שונה ממה שלמדנו עד עכשיו. למעשה היא בנויה ממצביע (Selector) ומהגדרה (Declaration). הגדרה מורכבת אף היא משני חלקים - מאפיין (Property) וערך (Value). כפי שהאיור הבא ממחיש זאת."
              ],
              "image": {
                "url": "/images/lessonsContents/module3/lesson1/declaration-css.png",
                "altText": "Declaration of CSS rule.",
                "width": [
                  300,
                  400
                ]
              }
            },
            {
              "textBlock": [
                "Declaration היא למעשה הגדרה של חוקיות בודדת שקיימת במאפיינים של הרכיב הנבחר. בהגדרה זו אנחנו בוחרים את המאפיין (Property) שאותו אנחנו רוצים לשנות או לקבוע, ואת הערך (Value) שאנחנו רוצים לעצב את הרכיב לפיו. כל הגדרה כזאת חייבת להכיל מאפיין וערך מופרדים בינהם בנקודותיים (:) ומסתיימים בסימן נקודה ופסיק (;).",
                "לדוגמא, ניקח את קוד ה-HTML הבא שמכיל כותרת ראשית, כפי שלמדנו ביחידת הלימוד הקודמת."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<h1>Sample Heading</h1>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "h1",
                    "content": "Sample Heading",
                    "style": {
                      "fontSize": "2em",
                      "marginTop": "0.67em",
                      "marginBottom": "0.67em",
                      "marginLeft": "0",
                      "marginRight": "0",
                      "fontWeight": "bold"
                    }
                  }
                ]
              }
            },
            {
              "textBlock": [
                "ונחיל עליה באמצעות שפת CSS עיצוב ייחודי. תחילה נצביע על סוג הרכיב (h1) ואז נגדיר את המאפיין (Property) שאותו אנחנו רוצים לקבוע (color) ולבסוף נקבע את הערך (Value) שלו לכחול."
              ],
              "codeBox": {
                "codeLang": "CSS",
                "lines": [
                  {
                    "element": "h1 { color: blue; }",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "h1",
                    "content": "Sample Heading",
                    "style": {
                      "color": "blue",
                      "fontSize": "2em",
                      "marginTop": "0.67em",
                      "marginBottom": "0.67em",
                      "marginLeft": "0",
                      "marginRight": "0",
                      "fontWeight": "bold"
                    }
                  }
                ]
              }
            },
            {
              "textBlock": [
                "Selector הוא למעשה המצביע שמסמן רכיב HTML מסוים שאותו אנחנו רוצים לעצב. אנחנו יכולים לבחור ולהצביע על רכיבים בכמה אופנים."
              ],
              "listBlock": [
                "בחירה של רכיב בודד - כמו בדוגמא להלן, בחירה של כותרת ראשית מסוג h1."
              ],
              "codeBox": {
                "codeLang": "CSS",
                "lines": [
                  {
                    "element": "h1 {",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "font-size: 18px;",
                    "color": "white",
                    "spaces": 2
                  },
                  {
                    "element": "}",
                    "color": "white",
                    "spaces": 0
                  }
                ]
              }
            },
            {
              "listBlock": [
                "בחירה מרובה של רכיבים - כמו בדוגמא להלן, בחירה של כותרת ראשית מסוג h1, פסקה מסוג p וקישור a. בחירה כזאת תעשה עם פסיקים מופרדים בין הרכיבים הנבחרים."
              ],
              "codeBox": {
                "codeLang": "CSS",
                "lines": [
                  {
                    "element": "h1, p, a {",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "font-size: 18px;",
                    "color": "white",
                    "spaces": 2
                  },
                  {
                    "element": "}",
                    "color": "white",
                    "spaces": 0
                  }
                ]
              }
            },
            {
              "listBlock": [
                "בחירה של רכיב שנמצא בתוך רכיב אחר - כמו בדוגמא שלהלן שתקפה לכל קישור שנמצא בתוך פסקה. בחירה כזאת תעשה בציון של רכיב ההורה, וציון של רכיב הילד עם רווח בינהם וללא פסיק."
              ],
              "codeBox": {
                "codeLang": "CSS",
                "lines": [
                  {
                    "element": "p a {",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "color: green;",
                    "color": "white",
                    "spaces": 2
                  },
                  {
                    "element": "}",
                    "color": "white",
                    "spaces": 0
                  }
                ]
              }
            },
            {
              "sectionTitle": "שיטות הצבעת Selectors",
              "textBlock": [
                "הצבעה על שם של תגית HTML כללית היא לא ממש תרגול טוב ונכון. הרגל יותר חכם יהיה להשתמש ב-class או ב-id כדי להחיל עיצוב על רכיב מסוים במסמך HTML. זאת משום ששמות התגיות ב-HTML נועדו בעיקר להבחנה סמנטית, והן כלליות מדי ואם נשתמש בהן כדי לעצב את העמוד שלנו, אנו עלולים למצוא את עצמנו מהר מאוד מסתבכים עם עיצובים שונים שאנחנו רוצים להחיל על רכיבים דומים. למשל של סוגי טקסטים שבשניהם אנחנו משתמשים בתגית פסקה p.",
                "לפי השיטה הזאת, אנחנו נציין את שם המחלקה (class) או הזהות (id) כ-selector, ואז נגדיר כרגיל את כל תכונות העיצוב הרצוי. כדי להבדיל בין שם של רכיב HTML (לדוגמא, <ul>) לבין שם של מחלקה או זהות נוסיף סימנים מיוחדים לפני שם המצביע (Selector).",
                "עבור מצביע מסוג class נוסיף לפניו את הסימן נקודה (.), ועבור מצביע מסוג id נוסיף את הסימן סולמית (#). "
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<div class='box'>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<p id='one-article'>Any content of long article...</p>",
                    "spaces": 4,
                    "color": "pink.200"
                  },
                  {
                    "element": "</div>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<div class='box'>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<p id='one-comment'>One comment of a user.</p>",
                    "spaces": 4,
                    "color": "pink.200"
                  },
                  {
                    "element": "</div>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</body>",
                    "spaces": 0,
                    "color": "white"
                  }
                ]
              }
            },
            {
              "codeBox": {
                "codeLang": "CSS",
                "lines": [
                  {
                    "element": "<style>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": ".box {",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "border: 1px solid blue;",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "margin: 5px;",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "}",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": " ",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "#one-article {",
                    "spaces": 2,
                    "color": "pink.200"
                  },
                  {
                    "element": "color: red;",
                    "spaces": 4,
                    "color": "pink.200"
                  },
                  {
                    "element": "}",
                    "spaces": 2,
                    "color": "pink.200"
                  },
                  {
                    "element": " ",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "#one-comment {",
                    "spaces": 2,
                    "color": "pink.200"
                  },
                  {
                    "element": "color: green;",
                    "spaces": 4,
                    "color": "pink.200"
                  },
                  {
                    "element": "}",
                    "spaces": 2,
                    "color": "pink.200"
                  },
                  {
                    "element": "</style>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "div",
                    "style": {
                      "border": "1px solid blue",
                      "margin": "5px"
                    },
                    "content": [
                      {
                        "type": "p",
                        "style": {
                          "color": "red"
                        },
                        "content": "Any content of long article..."
                      }
                    ]
                  },
                  {
                    "type": "div",
                    "style": {
                      "border": "1px solid blue",
                      "margin": "5px"
                    },
                    "content": [
                      {
                        "type": "p",
                        "style": {
                          "color": "green"
                        },
                        "content": "One comment of a user."
                      }
                    ]
                  }
                ]
              }
            },
            {
              "sectionTitle": "הערות מְפַתֵּחַ (Comments)",
              "textBlock": [
                "כמו ב-HTML, גם בשפת CSS אנחנו יכולים להוסיף הערות ולשלב אותן בתוך הקוד בלי שהן ישפיעו על הקוד. אך ב-CSS התחביר שלהן שונה במקצת. כדי להוסיף הערה בקובץ עיצוב משתמשים בתווים לוכסן (/) וכוכבית (*) באופן הבא:"
              ],
              "codeBox": {
                "codeLang": "CSS",
                "lines": [
                  {
                    "element": "/* Comment is the place to explain a piece of code in simple words. */",
                    "color": "yellow.300",
                    "spaces": 0
                  },
                  {
                    "element": "{ color: 'white'; }",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": " ",
                    "color": "white",
                    "spaces": 1
                  },
                  {
                    "element": "/*",
                    "color": "yellow.300",
                    "spaces": 0
                  },
                  {
                    "element": "You can also ",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "write a comment",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "with  multiple lines.",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "*/",
                    "color": "yellow.300",
                    "spaces": 0
                  },
                  {
                    "element": " ",
                    "color": "white",
                    "spaces": 1
                  },
                  {
                    "element": "/* {background-color: 'pink'; } */",
                    "color": "yellow.300",
                    "spaces": 0
                  }
                ]
              }
            },
            {
              "textBlock": [
                "כפי שניתן לשים לב, גם כאן כמו שלמדנו ביחידת הלימוד הקודמת, אנחנו יכולים להשתמש בהערות בשביל לכתוב הסברים וביאורים לקטע קוד מסוים שכתבנו, בשורה אחת או בכמה שורות. וכן, אפילו להכניס קטע קוד מסוים שאנחנו לא רוצים שיהיה פעיל באופן רגעי להערה וכך לבדוק דברים מסוימים בקוד."
              ]
            },
            {
              "resources": [
                {
                  "url": "https://developer.mozilla.org/en-US/docs/Learn/CSS/First_steps/Getting_started",
                  "title": "Getting started with CSS / Article by MDN Web docs"
                },
                {
                  "url": "https://developer.mozilla.org/en-US/docs/Learn/Getting_started_with_the_web/CSS_basics",
                  "title": "CSS Basics / Article by MDN Web docs"
                },
                {
                  "url": "https://www.w3schools.com/css/default.asp",
                  "title": "CSS Tutorial / Article by W3Schools"
                },
                {
                  "url": "https://www.w3schools.com/css/css_syntax.asp",
                  "title": "CSS Syntax / Article by W3Schools"
                },
                {
                  "url": "https://www.w3schools.com/css/css_selectors.asp",
                  "title": "CSS Selectors / Article by W3Schools"
                }
              ]
            }
          ]
        },
        {
          "lessonId": "3.2",
          "title": "תכנים טקסטואלים ועיצוב גופן",
          "sections": [
            {
              "sectionTitle": "עיצוב מילים",
              "textBlock": [
                "אחרי שלמדנו את התחביר של שפת CSS בשיעור הקודם (ואפילו ראינו כמה הוא כל כך פשוט), ולמדנו על לבחור ולהצביע על אלמנטים מסוימים במסמך HTML שלנו, הגיע הזמן להתחיל ללמוד לעצב. את המסע שלנו בעיצוב אתרי אינטרנט נתחיל עם הדבר הכי נפוץ  באינטרנט - טקסט.",
                "לטקסט יש מגוון רחב של מאפיינים ותכונות שאנחנו יכולים לשים דגש עליהם ולעצב אותם. יתר על כן, להופעה של הטקסט יש ערך חשוב ביותר עבור חוויית המשתמש. למשל האם יצא לכם לבקר באתר אינטרנט שכל הטקסט בו נכתב באותיות קטנות וצפופות? אם לא, חפשו במאגרי הספריה הלאומית עיתונים ישנים. איך זה גורם לכם להרגיש? האם הקריאה זורמת או מתאמצת? האם צורת הטקסט מעודדת אתכם להמשיך לקרוא או להפסיק את הקריאה?",
                "כל השאלות האלה הן חשובות ונוגעות בנושא רחב שנקרא - טיפוגרפיה - שיכול בקלות למלא קורס שלם, לכן אנחנו לא נכנס לעומקו, אלא נתמקד בצד הטכני של שימוש בגופנים ועיצובם עבור אתר אינטרנט."
              ]
            },
            {
              "sectionTitle": "גופנים ומרכיבי עיצוב",
              "textBlock": [
                "כמו שכבר הבנו, טקסטים ניתן לעיצוב במגוון מאפיינים ותכונות, ולשמחתנו אנחנו יכולים לשלוט בהם באמצעות כמה מאפיינים יעודיים שקיימים ב-CSS. אנחנו יכולים לקבוע את הצבע של הטקסט, את הגופן, את מידת ההדגשה ועוד תכונות. חוץ מאלה אנחנו יכולים לקבוע גם את הריווח של האותיות, המילים והשורות, את הרוחב של כל גוף הטקסט ביחס לעמוד או לרכיב שבו הוא נמצא, או את היישור של הטקסט לאחד הצדדים. במילים אחרות, אנחנו יכולים להבחין בין שני סוגים של מאפייני עיצוב, מאפיינים הנוגעים לאותיות ולמרכיבי הטקסט, בדרך-כלל יזוהו עם תחילת '-font', ומאפיינים שנוגעים לטקסט כגוף אחיד ושלם אשר יזוהו עם תחילית '-text'.",
                "אז הגיע הזמן להכיר את מאפייני CSS שעוזרים בתחום הזה."
              ],
              "tableData": {
                "caption": "מאפייני מרכיבי הטקסט",
                "headingRow": [
                  "מאפיין (Property)",
                  "ערכים אפשריים (Values)"
                ],
                "rows": [
                  [
                    "color",
                    "black / white / blue"
                  ],
                  [
                    "font-family",
                    "Arial, Verdana, sans-serif"
                  ],
                  [
                    "font-size",
                    "12px / 1em / 1.2rem"
                  ],
                  [
                    "line-height",
                    "12px / 1.5em / 1.6rem"
                  ],
                  [
                    "font-weight",
                    "normal / bold / 100-900"
                  ],
                  [
                    "font-style",
                    "normal / italic / oblique"
                  ]
                ]
              }
            },
            {
              "listBlock": [
                "color - צבע הטקסט יכול לקבל ערכים מסוגים שונים. סוג אחד הוא פשוט שמות הצבעים כפי שמתואר בטבלה. אפשר לראות פירוט מלא של כל שמות הצבעים בקישורים שמופיעים בסוף שיעור זה בקוביית \"מקורות והרחבת הידע\". בשיעור הבא נרחיב את הידע בנושא צבעים ונראה שיטות נוספות להגדרת צבע.",
                "font-size ו-line-height קובעים את גודל האותיות וגובה השורה בהתאמה, והשילוב של שניהם משפיע על ניראות הטקסט ועל יכולת הקריאות (Readability) שלו.",
                "בכל הנוגע לסוג הגופן - font-family - הדפדפן יכול להשתמש בגופן שקבענו רק אם אותו גופן קיים במחשב שבו הוא רץ או בהגדרת ברירת המחדל של הדפדפן עצמו. אם הוא לא מוצא את הגופן הנדרש הוא ישתמש בגופן ברירת המחדל שלו. לכן אנחנו נוהגים לציין עבור מאפיין זה מספר סוגים של גופנים, והדפדפן יודע כבר לבדוק כל אחד מהם לפי סדר החשיבות שלהם. יתר על כן, דבר חשוב נוסף שכדאי להכיר הוא שלא כל גופן הוא בהכרח ידידותי לאתרי אינטרנט, ואנחנו נשתמש לרוב בגופנים שנמצאים ברשימת ה-Web safe fonts, שאפשר למצוא קישור אליהם ברשימת המקורות שבסוף השיעור."
              ]
            },
            {
              "tableData": {
                "caption": "מאפייני הטקסט כגוף שלם",
                "headingRow": [
                  "מאפיין (Prperty)",
                  "ערכים אפשריים (Values)"
                ],
                "rows": [
                  [
                    "text-transform",
                    "none / uppercase / lowercase / capitalize / full-width"
                  ],
                  [
                    "text-decoration",
                    "none / underline / overline / line-through"
                  ],
                  [
                    "text-align",
                    "left / right / center / jusify"
                  ],
                  [
                    "letter-spacing",
                    "4px / 0.2em"
                  ],
                  [
                    "word-spacing",
                    "4px / 0.2em"
                  ],
                  [
                    "overflow",
                    "visible / hidden / clip / scroll / auto"
                  ],
                  [
                    "word-break",
                    "normal / break-all / keep-all / break-word"
                  ],
                  [
                    "text-shadow",
                    "H-offset V-offset blur color"
                  ]
                ]
              }
            },
            {
              "textBlock": [
                "בואו ונראה איך מיישמים הלכה למעשה את כל המאפיינים האלה בקוד עצמו. ניקח לדוגמא כותרת ראשית ופסקה, עברו על קוד ה-CSS ונסו לנחש איך יראה הפלט. לאחר מכן הציגו את הפלט ובידקו אם הוא נראה כמו שחשבתם."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<h1 class='mainTitle'>מגילת העצמאות</h1>",
                    "spaces": 2,
                    "color": "cyan.300"
                  },
                  {
                    "element": "<p class='textArticle'>בארץ ישראל קם העם היהודי, בה עוצבה דמותו הרוחנית, הדתית והמדינית, בה חי חיי קוממיות ממלכתית, בה יצר נכסי תרבות לאומיים וכלל אנושיים והוריש לעולם כולו את ספר הספרים הנצחי.</p>",
                    "spaces": 2,
                    "color": "pink.200"
                  },
                  {
                    "element": "<p class='textArticle'>לאחר שהוגלה העם מארצו בכוח הזרוע שמר לה אמונים בכל ארצות פזוריו, ולא חדל מתפילה ומתקוה לשוב לארצו ולחדש בתוכה את חירותו המדינית.</p>",
                    "spaces": 2,
                    "color": "pink.200"
                  },
                  {
                    "element": "<p class='textArticle'>מתוך קשר היסטורי ומסורתי זה חתרו היהודים בכל דור לשוב ולהאחז במולדתם העתיקה; ובדורות האחרונים שבו לארצם בהמונים, וחלוצים, מעפילים ומגינים הפריחו נשמות, החיו שפתם העברית, בנו כפרים וערים, והקימו ישוב גדל והולך השליט על משקו ותרבותו, שוחר שלום ומגן על עצמו, מביא ברכת הקידמה לכל תושבי הארץ ונושא נפשו לעצמאות ממלכתית.</p>",
                    "spaces": 2,
                    "color": "pink.200"
                  },
                  {
                    "element": "</body>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "div",
                    "style": {
                      "direction": "rtl"
                    },
                    "content": [
                      {
                        "type": "h1",
                        "style": {
                          "dir": "rtl",
                          "display": "block",
                          "fontSize": "2em",
                          "marginTop": "0.67em",
                          "marginBottom": "0.67em",
                          "marginLeft": "0",
                          "marginRight": "0",
                          "fontWeight": "bold"
                        },
                        "content": "מגילת העצמאות"
                      },
                      {
                        "type": "p",
                        "style": {
                          "dir": "rtl",
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0"
                        },
                        "content": "בארץ ישראל קם העם היהודי, בה עוצבה דמותו הרוחנית, הדתית והמדינית, בה חי חיי קוממיות ממלכתית, בה יצר נכסי תרבות לאומיים וכלל אנושיים והוריש לעולם כולו את ספר הספרים הנצחי."
                      },
                      {
                        "type": "p",
                        "style": {
                          "dir": "rtl",
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0"
                        },
                        "content": "לאחר שהוגלה העם מארצו בכוח הזרוע שמר לה אמונים בכל ארצות פזוריו, ולא חדל מתפילה ומתקוה לשוב לארצו ולחדש בתוכה את חירותו המדינית."
                      },
                      {
                        "type": "p",
                        "style": {
                          "dir": "rtl",
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0"
                        },
                        "content": "מתוך קשר היסטורי ומסורתי זה חתרו היהודים בכל דור לשוב ולהאחז במולדתם העתיקה; ובדורות האחרונים שבו לארצם בהמונים, וחלוצים, מעפילים ומגינים הפריחו נשמות, החיו שפתם העברית, בנו כפרים וערים, והקימו ישוב גדל והולך השליט על משקו ותרבותו, שוחר שלום ומגן על עצמו, מביא ברכת הקידמה לכל תושבי הארץ ונושא נפשו לעצמאות ממלכתית."
                      }
                    ]
                  }
                ]
              }
            },
            {
              "codeBox": {
                "codeLang": "CSS",
                "lines": [
                  {
                    "element": ".mainTitle {",
                    "spaces": 0,
                    "color": "cyan.300"
                  },
                  {
                    "element": "font-family: Verdana, Geneva, Tahoma, sans-serif;",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "font-size: 1.7em;",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "line-height: 1.5em;",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "text-align: center;",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "word-spacing: 0.1em;",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "text-transform: uppercase;",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "color: blue;",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "text-shadow: 2px -2px 1px white, 4px -4px 2px lightskyblue;",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "}",
                    "spaces": 0,
                    "color": "cyan.300"
                  },
                  {
                    "element": " ",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": ".textArticle {",
                    "spaces": 0,
                    "color": "pink.200"
                  },
                  {
                    "element": "width: 95%;",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "font-family: Verdana, Geneva, Tahoma, sans-serif;",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "font-size: 1.1em;",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "line-height: 1.5em;",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "text-align: justify;",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "word-spacing: 0.4em;",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "word-break: break-all;",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "}",
                    "spaces": 0,
                    "color": "pink.200"
                  }
                ],
                "outputCode": [
                  {
                    "type": "div",
                    "style": {
                      "direction": "rtl"
                    },
                    "content": [
                      {
                        "type": "h1",
                        "style": {
                          "marginTop": "0.67em",
                          "marginBottom": "0.67em",
                          "marginLeft": "0",
                          "marginRight": "0",
                          "fontWeight": "bold",
                          "fontFamily": "Verdana, Geneva, Tahoma, sans-serif",
                          "fontSize": "1.7em",
                          "lineHeight": "1.5em",
                          "textAlign": "center",
                          "wordSpacing": "0.1em",
                          "color": "blue",
                          "textShadow": "2px -2px 1px white, 4px -4px 2px lightskyblue"
                        },
                        "content": "מגילת העצמאות"
                      },
                      {
                        "type": "p",
                        "style": {
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0",
                          "fontFamily": "Verdana, Geneva, Tahoma, sans-serif",
                          "width": "95%",
                          "fontSize": "1.1em",
                          "lineHeight": "1.5em",
                          "textAlign": "justify",
                          "wordSpacing": "0.4em",
                          "wordBreak": "breakAll"
                        },
                        "content": "בארץ ישראל קם העם היהודי, בה עוצבה דמותו הרוחנית, הדתית והמדינית, בה חי חיי קוממיות ממלכתית, בה יצר נכסי תרבות לאומיים וכלל אנושיים והוריש לעולם כולו את ספר הספרים הנצחי."
                      },
                      {
                        "type": "p",
                        "style": {
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0",
                          "fontFamily": "Verdana, Geneva, Tahoma, sans-serif",
                          "width": "95%",
                          "fontSize": "1.1em",
                          "lineHeight": "1.5em",
                          "textAlign": "justify",
                          "wordSpacing": "0.4em",
                          "wordBreak": "breakAll"
                        },
                        "content": "לאחר שהוגלה העם מארצו בכוח הזרוע שמר לה אמונים בכל ארצות פזוריו, ולא חדל מתפילה ומתקוה לשוב לארצו ולחדש בתוכה את חירותו המדינית."
                      },
                      {
                        "type": "p",
                        "style": {
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0",
                          "fontFamily": "Verdana, Geneva, Tahoma, sans-serif",
                          "width": "95%",
                          "fontSize": "1.1em",
                          "lineHeight": "1.5em",
                          "textAlign": "justify",
                          "wordSpacing": "0.4em",
                          "wordBreak": "breakAll"
                        },
                        "content": "מתוך קשר היסטורי ומסורתי זה חתרו היהודים בכל דור לשוב ולהאחז במולדתם העתיקה; ובדורות האחרונים שבו לארצם בהמונים, וחלוצים, מעפילים ומגינים הפריחו נשמות, החיו שפתם העברית, בנו כפרים וערים, והקימו ישוב גדל והולך השליט על משקו ותרבותו, שוחר שלום ומגן על עצמו, מביא ברכת הקידמה לכל תושבי הארץ ונושא נפשו לעצמאות ממלכתית."
                      }
                    ]
                  }
                ]
              }
            },
            {
              "sectionTitle": "יחידות מידה",
              "textBlock": [
                "כמו שיכולתם לשים לב, השתמשנו בקטע הקוד במספר יחידות מידה עבור מאפיינים שונים בשביל רכיבי הטקסט שלנו. בשפת CSS יחידות המידה האלה נחלקות לשני סוגים עיקריים"
              ],
              "listBlock": [
                "יחידות מידה מוחלטות (Absolute Length Units)",
                "יחידות מידה יחסיות (Relative Length Units)"
              ]
            },
            {
              "textBlock": [
                "יחידות מידה מוחלטות הן קובעות את גודל האותיות, או גודל הרכיבים שאנחנו משתמשים בהם בעמוד, בצורה מוחלטת. ללא קשר והתייחסות למשתנים אחרים שקיימים בעמוד, כמו רכיבים אחרים, תוכן אחר או אפילו גודל המסך וסוג הדפדפן. יש כמה יחידות מידה כאלה, אך לרוב כשנרצה להשתמש ביחידות מידה מוחלטות אנחנו נציין את המידה בפיקסלים, או בקיצור - px.",
                "יחידות מידה יחסיות, הן יחידות שכן מתחשבות בגורמים שונים שקיימים בעמוד, כמו רכיבים שעוטפים אותם (רכיבי ההורה), או תוכן מילולי אחר וכדומה. בתוך יחידות מידה, אנחנו נכיר שתי יחידות יותר שימושיות - em ו-rem.",
                "יחידת המידה em קובעת את גודל הטקסט בהתאם ליחידת המידה המוחלטת של הרכיב ההורה שבה היא נמצאת. לעומתה, יחידת המידה rem קובעת את גודל הטקסט לפי יחידת המידה המוחלטת הראשית."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<div class='parent-element'>",
                    "spaces": 0,
                    "color": "pink.300"
                  },
                  {
                    "element": "Parent element",
                    "spaces": 2,
                    "color": "pink.300"
                  },
                  {
                    "element": "<div class='child-element__rem'>",
                    "spaces": 2,
                    "color": "cyan.300"
                  },
                  {
                    "element": "Child element",
                    "spaces": 4,
                    "color": "cyan.300"
                  },
                  {
                    "element": "<div class='child-element__rem'>",
                    "spaces": 4,
                    "color": "cyan.100"
                  },
                  {
                    "element": "Grandson element",
                    "spaces": 6,
                    "color": "cyan.100"
                  },
                  {
                    "element": "</div>",
                    "spaces": 4,
                    "color": "cyan.100"
                  },
                  {
                    "element": "</div>",
                    "spaces": 2,
                    "color": "cyan.300"
                  },
                  {
                    "element": "</div>",
                    "spaces": 0,
                    "color": "pink.300"
                  },
                  {
                    "element": " ",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "<div class='parent-element'>",
                    "spaces": 0,
                    "color": "pink.300"
                  },
                  {
                    "element": "Parent element",
                    "spaces": 2,
                    "color": "pink.300"
                  },
                  {
                    "element": "<div class='child-element__em'>",
                    "spaces": 2,
                    "color": "cyan.300"
                  },
                  {
                    "element": "Child element",
                    "spaces": 4,
                    "color": "cyan.300"
                  },
                  {
                    "element": "<div class='child-element__em'>",
                    "spaces": 4,
                    "color": "cyan.100"
                  },
                  {
                    "element": "Grandson element",
                    "spaces": 6,
                    "color": "cyan.100"
                  },
                  {
                    "element": "</div>",
                    "spaces": 4,
                    "color": "cyan.100"
                  },
                  {
                    "element": "</div>",
                    "spaces": 2,
                    "color": "cyan.300"
                  },
                  {
                    "element": "</div>",
                    "spaces": 0,
                    "color": "pink.300"
                  }
                ]
              }
            },
            {
              "codeBox": {
                "codeLang": "CSS",
                "lines": [
                  {
                    "element": ".parent-element {",
                    "spaces": 0,
                    "color": "pink.300"
                  },
                  {
                    "element": "font-size: 22px;",
                    "spaces": 2,
                    "color": "pink.300"
                  },
                  {
                    "element": "}",
                    "spaces": 0,
                    "color": "pink.300"
                  },
                  {
                    "element": ".child-element__rem {",
                    "spaces": 0,
                    "color": "cyan.300"
                  },
                  {
                    "element": "font-size: 1.5em;",
                    "spaces": 2,
                    "color": "cyan.300"
                  },
                  {
                    "element": "}",
                    "spaces": 0,
                    "color": "cyan.300"
                  },
                  {
                    "element": ".child-element__em {",
                    "spaces": 0,
                    "color": "cyan.300"
                  },
                  {
                    "element": "font-size: 0.7em;",
                    "spaces": 2,
                    "color": "cyan.300"
                  },
                  {
                    "element": "}",
                    "spaces": 0,
                    "color": "cyan.300"
                  }
                ],
                "outputCode": [
                  {
                    "type": "p",
                    "content": "Parent element - rem",
                    "style": {
                      "fontSize": "22px"
                    }
                  },
                  {
                    "type": "p",
                    "content": "Child element - rem",
                    "style": {
                      "fontSize": "33px"
                    }
                  },
                  {
                    "type": "p",
                    "content": "Grandson element - rem",
                    "style": {
                      "fontSize": "33px"
                    }
                  },
                  {
                    "type": "p",
                    "content": "Parent element - em",
                    "style": {
                      "fontSize": "22px"
                    }
                  },
                  {
                    "type": "p",
                    "content": "Child element - em",
                    "style": {
                      "fontSize": "15.4px"
                    }
                  },
                  {
                    "type": "p",
                    "content": "Grandson element - em",
                    "style": {
                      "fontSize": "10.78px"
                    }
                  }
                ]
              },
              "decorativeLine": true
            },
            {
              "sectionTitle": "זמן תרגול - יישום הגופן הנבחר במסמך HTML",
              "textBlock": [
                "כדי להשתמש בגופנים באתר שלנו אנחנו ניצור תיקייה ייעודית לכך בתוך התיקייה הראשית של הפרויקט ונקרא לה fonts. בתוך התיקייה הזאת למעשה נשמור את כל הגופנים שאנחנו רוצים להשתמש בהם באותו פרויקט. ונגדיר אותם בקובץ css נפרד עבור כל הגופנים."
              ],
              "codeBox": {
                "codeLang": "Files structure",
                "lines": [
                  {
                    "element": "/root",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "index.html",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "style.css",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "/fonts",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "fonts.css",
                    "spaces": 4,
                    "color": "yellow.300"
                  }
                ]
              }
            },
            {
              "textBlock": [
                "אנחנו יכולים למצוא מאגר גדול של גופנים ברחבי הרשת. בקורס הזה נשתמש בגופנים מתוך Google Fonts, שרובם ניתנים לשימוש באופן חינמי ובלי צורך בתשלום על שימוש והגנת זכויות יוצרים.",
                "חפשו את הגופנים הבאים:"
              ],
              "listBlock": [
                "Rubik",
                "Rubik Dirt",
                "Secular One"
              ]
            },
            {
              "textBlock": [
                "בקובץ font.css הוסיפו סט של חוקים שמגדירים את הגופנים שהורדתם ושמרתם בתיקייה הייעודית לפי הדוגמא הבאה:"
              ],
              "codeBox": {
                "codeLang": "fonts.css",
                "lines": [
                  {
                    "element": "@font-face {",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "font-family: 'FONT-NAME'",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "src: url('./fonts/FONT-NAME.ttf') format('truetype')",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "font-style: normal",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "font-weight: normal",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "}",
                    "spaces": 0,
                    "color": "white"
                  }
                ]
              }
            },
            {
              "textBlock": [
                "לאחר מכן, בקובץ ה-CSS הראשי יש לייבא (import) את קובץ הגופנים שיצרנו זה עתה, על מנת שנוכל להשתמש בגופן החדש בהתאם לשם שנתנו לו בקובץ הגופנים, כמו כל גופן אחר."
              ],
              "codeBox": {
                "codeLang": "styles.css",
                "lines": [
                  {
                    "element": ".text-element {",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "font-family: 'FONT-NAME', Arial, sans-serif",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "}",
                    "spaces": 0,
                    "color": "white"
                  }
                ]
              }
            },
            {
              "textBlock": [
                "לבסוף השתמשו בגופנים אלה בכתבות שיצרתם. עבור כותרות השתמשו בגופן Rubik Dirt, עבור תוכן הכתבות השתמשו בגופן Secular One, ועבור כל תוכן אחר השתמשו בגופן Rubik.",
                "מלבד זאת, קיבעו את הכותרות שתהיינה בגודל של 27px, עם גובה שורה (line height) של 29px, ללא הדגשה, ממורכז, ריווח בין מילים 3px וריווח בין אותיות של 2px.",
                "עבור כותרות משנה, במידה ויש בכתבות, הגדירו גודל אות 19px, גובה שורה 21px, טקסט מימין לשמאל, ריווח בין מילים של 1px, ריווח בין אותיות של 1px.",
                "עבור תוכן של כתבות הגדירו גודל אות 14px, גובה שורה 16px, טקסט מיושר לשני הצדדים, ריווח בין מילים של 2px, ריווח בין אותיות של 1px, ובשביל להפוך את הכתבות לאותנטיות ונאמנות למקור הוסיפו אפשרות של שבירת מילה בשורה חדשה (word-break).",
                "עבור קישורים שמופיעים בתוך הכתבה, הורידו מהם את הקו התחתון שמופיע כברירת מחדל וקבעו להם צבע ייחודי. כמו כן, בעת ריחוף של העכבר מעל הקישורים דאגו שהם ישנו את צבעם.",
                "תוכן שמציין קרדיט, כלומר ציון מקור הכתבה יהיה אף הוא עם מאפיינים יחודיים. הגופן זהה לזה של הכתבה עצמה, גודל האותיות 10px, גובה השורה 12px, הטקסט יהיה מיושר לשני הצדדים עם שבירת מילה בירידת שורה, ריווח בין מילים ובין אותיות 0.1px.",
                "תוכן של טבלה יהיה עם המאפיינים הבאים: גופן זהה לזה של הכתבה, גודל אותיות 12px, גובה שורה 14px, יישור הטקסט לימין."
              ]
            },
            {
              "resources": [
                {
                  "title": "The 20 Best HTML Fonts to Use in 2024 / Article by Hostinger Tutorials",
                  "url": "https://www.hostinger.com/tutorials/best-html-web-fonts"
                },
                {
                  "title": "Fundamentals text and font styling / Article by MDN web docs",
                  "url": "https://developer.mozilla.org/en-US/docs/Learn/CSS/Styling_text/Fundamentals"
                },
                {
                  "title": "HTML Color Names / Article by W3Schools",
                  "url": "https://www.w3schools.com/tags/ref_colornames.asp"
                },
                {
                  "title": "Difference between em and rem units in CSS / Article by Geeks for geeks",
                  "url": "https://www.geeksforgeeks.org/difference-between-em-and-rem-units-in-css/"
                },
                {
                  "title": "Google Fonts",
                  "url": "https://fonts.google.com/"
                },
                {
                  "title": "Pixels to em units converter by W3Schools",
                  "url": "https://www.w3schools.com/cssref/css_pxtoemconversion.php"
                },
                {
                  "title": "מגילת העצמאות / מתוך אתר כנסת ישראל",
                  "url": "https://main.knesset.gov.il/about/occasion/pages/declaration.aspx"
                }
              ]
            }
          ]
        },
        {
          "lessonId": "3.3",
          "title": "צבעים וצללים",
          "sections": [
            {
              "sectionTitle": "צִבְעוֹנִיוּת",
              "image": {
                "url": "/images/lessonsContents/module3/lesson3/photo-by-belinda-fewings-on-unsplash.jpg",
                "altText": "ציור קיר של הצייר Hendog של ילד בונה חומה מלבנים צבעוניות. התמונה צולמה ע\"י Belinda Fewings מתוך אתר Unsplash",
                "descText": "ציור קיר של הצייר Hendog של ילד בונה חומה מלבנים צבעוניות. התמונה צולמה ע\"י Belinda Fewings מתוך אתר Unsplash",
                "width": [
                  300,
                  400
                ]
              }
            },
            {
              "textBlock": [
                "בעיתונים של פעם יכולנו למצוא הכל בשחור ולבן, אפילו תמונות אם הוצגו בעיתון היו בשחור ולבן. לפעמים אם ממש רצו להציג יותר פירוט אז התמונות היו בגווני אפור. אבל מאז ועד היום העיתונות התקדמה בכמה צעדים ויכולה להדפיס תוכן צבעוני, גם בטקסט וגם בתמונות.",
                "לצבעוניות יש משמעות חשובה וייחודית מאוד לא רק בפן האסתטי והחיצוני של איך נראה עיתון, ספר, דף אינטרנט או אתר בכלל. מחד צבעוניות יכולה לתרום לחוויית משתמש נעימה וטובה ולסדר את רכיבי התוכן באופן ברור ובולט, אך מאידך היא יכולה גם לפגום בה מאוד ולהעמיס על העיניים בלגן של צבעים.",
                "צבעוניות טובה חשובה לא רק לחוויית משתמש נעימה, אלא היא קריטית גם עבור משתמשים בעלי לקויות שונות. לדוגמא, ישנם שילובי צבעים שעיוורי צבעים לא מסוגלים לראות, ניגודיות חלשה בין צבע הטקסט לצבע הרקע יכולה לפגום, ואף גרוע מכך, מאוד ביכולתו של אדם לקוי ראיה לקרוא את תוכן האתר. חולי אפליפסיה עשויים לחוות קושי גדול עם צבעוניות יתר. יש כמובן עוד מוגבלויות וצרכים משתנים של אנשים שונים והנושא הזה ללא ספק יכול למלא קורס בפני עצמו. בשיעור הזה אנחנו נלמד על דרכים להוסיף צבע לאתר שלנו."
              ]
            },
            {
              "sectionTitle": "צבעים באתר אינטרנט",
              "textBlock": [
                "כפי שראינו בשיעור הקודם, אחד המאפיינים שאנחנו יכולים להגדיר עבור גופנים הוא צבע (color) שקובע את צבע הטקסט. ראינו גם שאנחנו יכולים פשוט לרשום את שם הצבע הרצוי (black, white, yellow, green, cyan and etc) ולקבל את התוצאה הרצויה בדפדפן.",
                "אכן זו שיטה נהדרת, קלה ופשוטה להשתמש בשמות הצבעים המוכנים והמובנים בשפת CSS, ולמעשה יש 140 שמות שונים של צבעים שמוכנים לשימוש ומחכים שנשתמש בהם. אפשר לראות את הרשימה המלאה באתר הבא."
              ],
              "bigButton": {
                "urlLink": "https://www.w3schools.com/colors/colors_names.asp",
                "text": "שמות הצבעים"
              }
            },
            {
              "textBlock": [
                "אבל זה לא הכל, יש צורה נוספת שאנחנו יכולים לייצג בעזרתה אפילו יותר צבעים. השיטה הזאת מבוססת על שלושת צבעי היסוד - אדום, ירוק וכחול, אשר במינונים שונים של כל אחד מהם אנחנו יכולים לקבל כל צבע שאנחנו יכולים לחשוב עליו הקיים בספקטרום הצבעים הנראה. לשיטה הזאת אנחנו קוראים RGB - כשמם של שלושת צבעי היסוד באנגלית - Red, Green, Blue."
              ],
              "image": {
                "url": "/images/stylingImages/RGB-icon.png",
                "altText": "RGB inspiration image.",
                "width": [
                  300,
                  400
                ],
                "backgroundColor": "transparent"
              }
            },
            {
              "textBlock": [
                "למעשה לפי השיטה הזאת לכל צבע יש 256 רמות, בין 0 ל-255, כאשר 0 משמעו היעדר מוחלט של הצבע, ו-255 משמעו עוצמה מלאה של אותו צבע. אפשר לדמיין שלושה פנסים שמאירים כל אחד בצבע אחר, פנס אדום, פנס ירוק ופנס כחול, ובאמצעות הארה של שלושתם על נקודה מסוימת בעוצמות שונות נקבל צבעים שונים. "
              ]
            },
            {
              "sectionTitle": "צורות הצגה של צבעים",
              "textBlock": [
                "אם כן, אנחנו יכולים לייצג צבע מסוים בעזרת הגדרת כל אחד מצבעי היסוד בתכונה color בעזרת שימוש במתודה rgb והגדרת שלושה פרמטרים מספריים שמייצגים את שלושת צבעי היסוד. הפרמטר הראשון - אדום, הפרמטר השני - ירוק, והפרמטר השלישי - כחול. בקטע הקוד הבא ניתן לראות את אופן השימוש בקוד."
              ],
              "codeBox": {
                "codeLang": "HTML + CSS",
                "lines": [
                  {
                    "element": "<head>",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "<style>",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "#firstText { color: rgb(255, 0, 0); }",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "#secondText { color: rgb(0, 255, 0); }",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "#thirdText { color: rgb(0, 0, 255); }",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "</style>",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "</head>",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "<body>",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "<p id='firstText'>Text</p>",
                    "color": "white",
                    "spaces": 2
                  },
                  {
                    "element": "<p id='secondText'>Text</p>",
                    "color": "white",
                    "spaces": 2
                  },
                  {
                    "element": "<p id='thirdText'>Text</p>",
                    "color": "white",
                    "spaces": 2
                  },
                  {
                    "element": "</body>",
                    "color": "white",
                    "spaces": 0
                  }
                ],
                "outputCode": [
                  {
                    "type": "p",
                    "style": {
                      "color": "rgb(255, 0, 0)",
                      "paddingTop": "10px",
                      "paddingBottom": "10px",
                      "fontWeight": "bold",
                      "fontSize": "24px",
                      "textAlign": "center"
                    },
                    "content": "Text"
                  },
                  {
                    "type": "p",
                    "style": {
                      "color": "rgb(0, 255, 0)",
                      "paddingTop": "10px",
                      "paddingBottom": "10px",
                      "fontWeight": "bold",
                      "fontSize": "24px",
                      "textAlign": "center"
                    },
                    "content": "Text"
                  },
                  {
                    "type": "p",
                    "style": {
                      "color": "rgb(0, 0, 255)",
                      "paddingTop": "10px",
                      "paddingBottom": "10px",
                      "fontWeight": "bold",
                      "fontSize": "24px",
                      "textAlign": "center"
                    },
                    "content": "Text"
                  }
                ]
              }
            },
            {
              "textBlock": [
                "נסו לשחק עם מערבל הצבעים וצרו בעזרתו צבעים שונים. נסו ליצור צבעים שהם לא צבעי יסוד. למשל איך אפשר ליצור צהוב, סגול, כתום, חום?"
              ],
              "bigButton": {
                "urlLink": "https://www.w3schools.com/colors/colors_rgb.asp",
                "text": "מערבל צבעים"
              }
            },
            {
              "textBlock": [
                "אפשרות נוספת היא לייצג את הצבע באמצעות ספרות הקסא-דצימליות (Hexadecimal numbers). לצורך כך נתחיל עם סימן סולמית, ומיד אחריה שש ספרות שכל שתיים מהן מייצגות צבע יסוד אחר. שתי הספרות הראשונות מייצגות את רמת האדום, שתי הספרות המרכזיות מייצגות את רמת הצבע הירוק, ושתי הספרות האחרונות מייצגות את רמת הצבע הכחול."
              ],
              "codeBox": {
                "codeLang": "HTML + CSS",
                "lines": [
                  {
                    "element": "<head>",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "<style>",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "#firstText { color: #ff0000; }",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "#secondText { color: #00ff00; }",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "#thirdText { color: #0000ff; }",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "</style>",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "</head>",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "<body>",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "<p id='firstText'>Text</p>",
                    "color": "white",
                    "spaces": 2
                  },
                  {
                    "element": "<p id='secondText'>Text</p>",
                    "color": "white",
                    "spaces": 2
                  },
                  {
                    "element": "<p id='thirdText'>Text</p>",
                    "color": "white",
                    "spaces": 2
                  },
                  {
                    "element": "</body>",
                    "color": "white",
                    "spaces": 0
                  }
                ],
                "outputCode": [
                  {
                    "type": "p",
                    "style": {
                      "color": "#ff0000",
                      "paddingTop": "10px",
                      "paddingBottom": "10px",
                      "fontWeight": "bold",
                      "fontSize": "24px",
                      "textAlign": "center"
                    },
                    "content": "Text"
                  },
                  {
                    "type": "p",
                    "style": {
                      "color": "#00ff00",
                      "paddingTop": "10px",
                      "paddingBottom": "10px",
                      "fontWeight": "bold",
                      "fontSize": "24px",
                      "textAlign": "center"
                    },
                    "content": "Text"
                  },
                  {
                    "type": "p",
                    "style": {
                      "color": "#0000ff",
                      "paddingTop": "10px",
                      "paddingBottom": "10px",
                      "fontWeight": "bold",
                      "fontSize": "24px",
                      "textAlign": "center"
                    },
                    "content": "Text"
                  }
                ]
              }
            },
            {
              "sectionTitle": "מילים ורקע",
              "textBlock": [
                "ראינו שאפשר לצבוע טקסט בכל צבע שרק נרצה, אבל מה עם הרקע? גם אותו אנחנו יכולים להגדיר כרצוננו בעזרת תכונה נוספת שנמצאת בשפה ורק מחכה שנשתמש בה. התבוננו בקטע הקוד ונסו לנחש אילו צבעים תראו בפלט  לפני שתפתחו את חלון הפלט."
              ],
              "codeBox": {
                "codeLang": "HTML + CSS",
                "lines": [
                  {
                    "element": "<head>",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "<style>",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "#firstBox { background-color: #ff0000; }",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "#firstText { color: #00ffff; }",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "#secondBox { background-color: #00ff00; }",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "#secondText { color: #ff00ff; }",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "#thirdBox { background-color: #0000ff; }",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "#thirdText { color: #ffff00; }",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "</style>",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "</head>",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "<body>",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "<div id='firstBox'>",
                    "color": "white",
                    "spaces": 2
                  },
                  {
                    "element": "<p id='firstText'>Text</p>",
                    "color": "white",
                    "spaces": 4
                  },
                  {
                    "element": "</div>",
                    "color": "white",
                    "spaces": 2
                  },
                  {
                    "element": "<div id='secondBox'>",
                    "color": "white",
                    "spaces": 2
                  },
                  {
                    "element": "<p id='secondText'>Text</p>",
                    "color": "white",
                    "spaces": 4
                  },
                  {
                    "element": "</div>",
                    "color": "white",
                    "spaces": 2
                  },
                  {
                    "element": "<div id='thirdBox'>",
                    "color": "white",
                    "spaces": 2
                  },
                  {
                    "element": "<p id='thirdText'>Text</p>",
                    "color": "white",
                    "spaces": 4
                  },
                  {
                    "element": "</div>",
                    "color": "white",
                    "spaces": 2
                  },
                  {
                    "element": "</body>",
                    "color": "white",
                    "spaces": 0
                  }
                ],
                "outputCode": [
                  {
                    "type": "p",
                    "style": {
                      "backgroundColor": "#ff0000",
                      "color": "#00ffff",
                      "paddingTop": "10px",
                      "paddingBottom": "10px",
                      "fontWeight": "bold",
                      "fontSize": "24px",
                      "textAlign": "center"
                    },
                    "content": "Text"
                  },
                  {
                    "type": "p",
                    "style": {
                      "backgroundColor": "#00ff00",
                      "color": "#ff00ff",
                      "paddingTop": "10px",
                      "paddingBottom": "10px",
                      "fontWeight": "bold",
                      "fontSize": "24px",
                      "textAlign": "center"
                    },
                    "content": "Text"
                  },
                  {
                    "type": "p",
                    "style": {
                      "backgroundColor": "#0000ff",
                      "color": "#ffff00",
                      "paddingTop": "10px",
                      "paddingBottom": "10px",
                      "fontWeight": "bold",
                      "fontSize": "24px",
                      "textAlign": "center"
                    },
                    "content": "Text"
                  }
                ]
              }
            },
            {
              "frameClause": {
                "frameTitle": "גווני אפור",
                "paragraphs": [
                  "כאמור, בעזרת שילוב של שלושת הצבעים ברמות שונות אנחנו יכולים ליצור את כל צבעי הקשת. אך מה אם אנחנו רוצים ליצור את הצבע האפור, ובכלל כמה גוונים של אפור אנחנו יכולים ליצור בעזרת השיטה הזאת שלמדנו עכשיו? (רמז, יש יותר מחמישים גוונים של אפור).",
                  "בדקו זאת באמצעות מערבל הצבעים וחישבו על כך, האם באופן תאורתי אנחנו יכולים ליצור אפילו יותר גווני אפור ממה שמצאתם?"
                ]
              }
            },
            {
              "sectionTitle": "שקיפות",
              "textBlock": [
                "בהמשך יחידת הלימוד הזאת אנחנו נלמד על שכבות בעמוד האינטרנט שמאפשרות לנו לקבוע מיקום של רכיבים מסויימים בעמוד, לא רק בממדים של הגובה והרוחב של המסך, אלא לקבוע גם רכיב שימוקמו מלפנים או מאחורי רכיבים אחרים. בשיעור הזה לא נלמד על התכונה הזאת, אלא רק נכיר את האפשרות של שקיפות הצבע של אובייקט מסוים.",
                "שקיפות משמעה שניתן לראות את האובייקט שנמצא מתחת לאובייקט שעליו אנחנו עובדים כרגע. כברירת מחדל כשאנחנו מגדירים צבע באחת הדרכים שלמדנו, השקיפות היא 0% (או במילים אחרות 100% אטימות). כדי לשנות את השקיפות, אנחנו צריכים להשתמש בפונקציה rgba (במקום ב-rgb), שמקבלת פרמטר רביעי שמציין את מידת השקיפות בערכים שנעים בין 0 ל-1. כאשר הערך 1 מציין 100% אטימות, והערך 0 מציין 0% אטימות."
              ],
              "tableData": {
                "caption": "",
                "headingRow": ["שקיפות", "אטימות", "CSS"],
                "rows": [
                  ["0%", "100%", "rgba(0, 0, 0, 1)"],
                  ["20%", "80%", "rgba(0, 0, 0, 0.8)"],
                  ["40%", "60%", "rgba(0, 0, 0, 0.6)"],
                  ["60%", "40%", "rgba(0, 0, 0, 0.4)"],
                  ["80%", "20%", "rgba(0, 0, 0, 0.2)"],
                  ["100%", "0%", "rgba(0, 0, 0, 0)"]
                ]
              },
              "codeBox": {
                "codeLang": "HTML + CSS",
                "lines": [
                  {
                    "element": "<head>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<style>",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": ".container {",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "background-color: rgb(168, 168, 168);",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "}",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": ".box {",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "width: 100%",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "height: 70px",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "border: 1px solid rgb(0, 0, 0)",
                    "spaces": 6,
                    "color": "white"
                  },
                  {
                    "element": "}",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "#box1 { background-color: rgba(255, 0, 0, 1) };",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "#box2 { background-color: rgba(255, 0, 0, 0.8) };",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "#box3 { background-color: rgba(255, 0, 0, 0.6) };",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "#box4 { background-color: rgba(255, 0, 0, 0.4) };",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "#box5 { background-color: rgba(255, 0, 0, 0.2) };",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "#box6 { background-color: rgba(255, 0, 0, 0) };",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "</style>",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "</head>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<body>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<div class='container'>",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "<div class='box' id='box1'>Box 1</div>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<div class='box' id='box2'>Box 2</div>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<div class='box' id='box3'>Box 3</div>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<div class='box' id='box3'>Box 4</div>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<div class='box' id='box3'>Box 5</div>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<div class='box' id='box3'>Box 6</div>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "</div>",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "</body>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "div",
                    "style": {
                      "backgroundColor": "rgb(168, 168, 168)",
                      "padding": "10px",
                      "display": "flex",
                      "flexDirection": "column",
                      "justifyContent": "center",
                      "alignItems": "center"
                    },
                    "content": [
                      {
                        "type": "div",
                        "style": {
                          "width": "80%",
                          "height": "70px",
                          "backgroundColor": "rgba(255, 0, 0, 1)",
                          "marginBottom": "10px",
                          "border": "1px solid black"
                        },
                        "content": "Box 1"
                      },
                      {
                        "type": "div",
                        "style": {
                          "width": "80%",
                          "height": "70px",
                          "backgroundColor": "rgba(255, 0, 0, 0.8)",
                          "marginBottom": "10px",
                          "border": "1px solid black"
                        },
                        "content": "Box 2"
                      },
                      {
                        "type": "div",
                        "style": {
                          "width": "80%",
                          "height": "70px",
                          "backgroundColor": "rgba(255, 0, 0, 0.6)",
                          "marginBottom": "10px",
                          "border": "1px solid black"
                        },
                        "content": "Box 3"
                      },
                      {
                        "type": "div",
                        "style": {
                          "width": "80%",
                          "height": "70px",
                          "backgroundColor": "rgba(255, 0, 0, 0.4)",
                          "marginBottom": "10px",
                          "border": "1px solid black"
                        },
                        "content": "Box 4"
                      },
                      {
                        "type": "div",
                        "style": {
                          "width": "80%",
                          "height": "70px",
                          "backgroundColor": "rgba(255, 0, 0, 0.2)",
                          "marginBottom": "10px",
                          "border": "1px solid black"
                        },
                        "content": "Box 5"
                      },
                      {
                        "type": "div",
                        "style": {
                          "width": "80%",
                          "height": "70px",
                          "backgroundColor": "rgba(255, 0, 0, 0)",
                          "marginBottom": "10px",
                          "border": "1px solid black"
                        },
                        "content": "Box 6"
                      }
                    ]
                  }
                ]
              }
            },
            {
              "sectionTitle": "אזור הדמדומים והצללים",
              "textBlock": [
                "תכונה נוספת שיכולה להוסיף מימד נוסף לאתר שלנו ולהפוך לכמעט תלת מימדי. ראשית כל, ברור שהאתר שלנו מיועד לתצוגה במסכים דו-מימדיים בלבד, והדבר הזה לא צפוי להשתנות, אך בעזרת תכונות חזותיות אנחנו יכולים לתת למשתמש את התחושה של תלת מימדיות על-ידי הוספת אפקט חזותי שמדמה צל.",
                "לצורך כך אנחנו יכולים להשתמש בתכונה text-shadow כדי להוסיף את האפקט החזותי המעניין הזה ולתת תחושה שבזמן לחיצה על כפתור שאנחנו מוסיפים לאתר, הכפתור באמת נלחץ. או לתת לכותרות באתר שלנו אפקט מרשים יותר. אך לצד זאת, כדי גם טיפה להזהר עם שימוש יתר באפקט הזה, מכיוון שזה גם יכול להעמיס יותר על עיצוב האתר ולהפוך אותו לבנאלי ומשעמם."
              ],
              "codeBox": {
                "codeLang": "HTML + CSS",
                "lines": [
                  {
                    "element": "<head>",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "<style>",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "#sampleText {",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "color: rgb(255, 0, 0);",
                    "color": "yellow.300",
                    "spaces": 6
                  },
                  {
                    "element": "text-shadow: 3px -3px 2px rgb(168, 168, 168);",
                    "color": "yellow.300",
                    "spaces": 6
                  },
                  {
                    "element": "}",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "</style>",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "</head>",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "<body>",
                    "color": "white",
                    "spaces": 0
                  },
                  {
                    "element": "<p id='sampleText'>Text</p>",
                    "color": "white",
                    "spaces": 2
                  },
                  {
                    "element": "</body>",
                    "color": "white",
                    "spaces": 0
                  }
                ],
                "outputCode": [
                  {
                    "type": "p",
                    "style": {
                      "color": "rgb(255, 0, 0)",
                      "textShadow": "3px -3px 2px rgb(168, 168, 168)",
                      "paddingTop": "10px",
                      "paddingBottom": "10px",
                      "fontWeight": "bold",
                      "fontSize": "24px",
                      "textAlign": "center"
                    },
                    "content": "Text"
                  }
                ]
              }
            },
            {
              "textBlock": [
                "למעשה התכונה text-shadow מקבלת ארבעה פרמטרים שקובעים, כל פרמטר מופרד באמצעות רווח. הפרמטר הראשון מציין את מרחק הצל מהאובייקט על הציר האופקי כאשר סימן חיובי מציין שמאלה וסימן שלילי מציין ימינה מהאובייקט. הפרמטר השני מציין את אותו דבר רק על הציר האנכי, כאשר סימן חיובי מציין מתחת לאובייקט, ואילו סימן שלילי מעליו. הפרמטר השלישי מציין את מידת החדות של הצל, ככל שהערך גבוה יותר החדות תהיה כהה יותר. והפרמטר הרביעי מציין את הצבע."
              ]
            },
            {
              "sectionTitle": "תבניות צבע",
              "textBlock": [
                "כמפתחים אנחנו יודעים עכשיו איך להוסיף צבע לאתר שלנו, אבל חשוב לדעת שזהו נושא שיכול למלא מספר קורסים שלמים, ואף יש בעלי מקצוע כמו מעצבים גרפיים, מעצבי UI, וגרפקאים שמתעסקים רק עם הנושאים האלה. לכן עבודתנו כמפתחים לא צריכה להתמקד בשילוב הצבעים האידאלי, כי ברוב הפעמים אנחנו כבר נקבל תבנית מסוימת של צבעים מהמומחים בדבר.",
                "באופן דומה, אם אנחנו עובדים על פרויקט אישי, ולא כחלק מצוות רב מקצועי, אנחנו יכולים להעזר בשלל אתרים באינטרנט שדואגים לנו בדיוק בשביל למצוא את שילוב הצבעים שאנחנו מחפשים. שתי דוגמאות טובות לאתרים כאלה הם Canva ו-Color Hunt. בשניהם אנחנו יכולים למצוא מאות תבניות צבעים מוכנות ולהשתמש בהן.",
                "מעניין לדעת על מותגים שכולנו מכירים איך הם קבעו את הצבעים של המותג שלהם. למשל, חשבתם פעם איך Google בחרו את צבעי הלוגו שלהם? או למה Facebook בחרו דווקא בצבע הכחול? אז לשאלות כמו אלה אנחנו לא נכנס כאן בקורס הזה, כי אפשר להעמיק את הדיבור על ההשפעה של צבעים על הפסיכולוגיה של האדם, אבל אנחנו כן יכולים לראות באיזה צבעים מדויקים מותגים שונים משתמשים."
              ],
              "bigButton": {
                "text": "צבעי מותגים",
                "urlLink": "https://www.w3schools.com/colors/colors_brands.asp"
              },
              "decorativeLine": "true"
            },
            {
              "sectionTitle": "זמן תרגול",
              "textBlock": [
                "תרגיל מתגלגל"
              ]
            },
            {
              "resources": [
                {
                  "title": "Colors tutorial by W3Schools",
                  "url": "https://www.w3schools.com/colors/default.asp"
                },
                {
                  "title": "חיפוש תבניות צבעים לפי נושאים של Color Hunt",
                  "url": "https://colorhunt.co/"
                },
                {
                  "title": "תבניות צבעים של אתר Canva.",
                  "url": "https://www.canva.com/colors/color-palettes/"
                },
                {
                  "title": "WebAIM - Contrast checker",
                  "url": "https://webaim.org/resources/contrastchecker/"
                }
              ]
            }
          ]
        },
        {
          "lessonId": "3.4",
          "title": "עיצוב העמוד הכללי",
          "sections": []
        },
        {
          "lessonId": "3.5",
          "title": "תיבות עיצוב (Box Model) וריווח",
          "sections": []
        },
        {
          "lessonId": "3.6",
          "title": "CSS3: Flexbox",
          "sections": []
        },
        {
          "lessonId": "3.7",
          "title": "CSS3: Grid",
          "sections": []
        },
        {
          "lessonId": "3.8",
          "title": "מיקום בעמוד, Position",
          "sections": []
        },
        {
          "lessonId": "3.9",
          "title": "SASS",
          "sections": []
        },
        {
          "lessonId": "3.10",
          "title": "מבוא לאנימציות",
          "sections": []
        },
        {
          "lessonId": "3.11",
          "title": "בחן את עצמך",
          "sections": []
        },
        {
          "lessonId": "3.12",
          "title": "הרחבה: בסיסי ספירה",
          "sections": [
            {
              "tableData": {
                "caption": "מספרים עשרוניים, בינאריים והקסא-דצימליים",
                "headingRow": [
                  "בסיס 10",
                  "בסיס 2",
                  "בסיס 16"
                ],
                "rows": [
                  [
                    "0",
                    "0",
                    "0"
                  ],
                  [
                    "1",
                    "1",
                    "1"
                  ],
                  [
                    "2",
                    "10",
                    "2"
                  ],
                  [
                    "3",
                    "11",
                    "3"
                  ],
                  [
                    "4",
                    "100",
                    "4"
                  ],
                  [
                    "5",
                    "101",
                    "5"
                  ],
                  [
                    "6",
                    "110",
                    "6"
                  ],
                  [
                    "7",
                    "111",
                    "7"
                  ],
                  [
                    "8",
                    "1000",
                    "8"
                  ],
                  [
                    "9",
                    "1001",
                    "9"
                  ],
                  [
                    "10",
                    "1010",
                    "A"
                  ],
                  [
                    "11",
                    "1011",
                    "B"
                  ],
                  [
                    "12",
                    "1100",
                    "C"
                  ],
                  [
                    "13",
                    "1101",
                    "D"
                  ],
                  [
                    "14",
                    "1110",
                    "E"
                  ],
                  [
                    "15",
                    "1111",
                    "F"
                  ],
                  [
                    "16",
                    "10000",
                    "10"
                  ]
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "module": 4,
      "title": "Java Script",
      "lessons": [
        {
          "lessonId": "4.1",
          "title": "מבוא ל-Java Script",
          "sections": [
            {
              "sectionTitle": "מבוא ל-Java Script",
              "image": {
                "url": "/images/stylingImages/cover-js.png",
                "altText": "A steam train travels on an ancient bridge that crosses a green valley.",
                "descText": "A steam train travels on an ancient bridge that crosses a green valley. Photo by Simon Franz Hochleitner on Unsplash.",
                "width": [
                  300,
                  500
                ]
              }
            },
            {
              "resources": [
                {
                  "title": "Introduction / Article by MDN web docs",
                  "url": "https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Introduction"
                }
              ]
            }
          ]
        },
        {
          "lessonId": "4.2",
          "title": "משתנים, מחרוזות וסוגי נתונים אחרים",
          "sections": [
            {
              "resources": [
                {
                  "title": "Grammer and types / Article by MDN web docs",
                  "url": "https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Grammar_and_types#declarations"
                }
              ]
            }
          ]
        },
        {
          "lessonId": "4.3",
          "title": "מערכים (Arrays)",
          "sections": []
        },
        {
          "lessonId": "4.4",
          "title": "אובייקטים (Objects)",
          "sections": []
        },
        {
          "lessonId": "4.5",
          "title": "לולאות (Loops)",
          "sections": []
        },
        {
          "lessonId": "4.6",
          "title": "תכנות מונחה עצמים, Object Oriented Programming (OOP)",
          "sections": []
        },
        {
          "lessonId": "4.7",
          "title": "פונקציות (Functions)",
          "sections": []
        },
        {
          "lessonId": "4.8",
          "title": "מחלקות (Classes)",
          "sections": []
        },
        {
          "lessonId": "4.9",
          "title": "פונקציות א-סינכרוניות (Promises)",
          "sections": []
        }
      ]
    },
    {
      "module": 5,
      "title": "פרויקט סיום",
      "lessons": [
        {
          "lessonId": "5.1",
          "title": "בחירת נושא לפרויקט",
          "sections": []
        },
        {
          "lessonId": "5.2",
          "title": "תכנון הפרויקט",
          "sections": []
        },
        {
          "lessonId": "5.3",
          "title": "ביצוע הפרויקט",
          "sections": []
        }
      ]
    },
    {
      "module": 6,
      "title": "משוב על הקורס",
      "lessons": [
        {
          "lessonId": "6.1",
          "title": "תן דעתך על הקורס",
          "sections": []
        },
        {
          "lessonId": "6.2",
          "title": "רמת הקושי של הקורס",
          "sections": []
        },
        {
          "lessonId": "6.3",
          "title": "מידת העניין בקורס",
          "sections": []
        }
      ]
    }
  ]
}